{
  "summary": {
    "extraction_method": "wikipedia_api",
    "processed_traditions": 14,
    "total_articles_attempted": 42,
    "total_successful_extractions": 40,
    "overall_success_rate": 0.9523809523809523,
    "total_words_extracted": 210143,
    "average_words_per_article": 5253.575
  },
  "traditions": {
    "golden_dawn": {
      "tradition_name": "golden_dawn",
      "display_name": "Golden Dawn",
      "extracted_articles": [
        {
          "title": "Hermetic Order of the Golden Dawn",
          "url": "https://en.wikipedia.org/wiki/Hermetic_Order_of_the_Golden_Dawn",
          "summary": "The Hermetic Order of the Golden Dawn (Latin: Ordo Hermeticus Aurorae Aureae), more commonly the Golden Dawn (Aurora Aurea), was a secret society devoted to the study and practice of occult Hermeticism and metaphysics during the late 19th and early 20th centuries. Known as a magical order, the Hermetic Order of the Golden Dawn was active in Great Britain and focused its practices on theurgy and spiritual development. Many present-day concepts of ritual and magic that are at the centre of contem...",
          "full_content": "The Hermetic Order of the Golden Dawn (Latin: Ordo Hermeticus Aurorae Aureae), more commonly the Golden Dawn (Aurora Aurea), was a secret society devoted to the study and practice of occult Hermeticism and metaphysics during the late 19th and early 20th centuries. Known as a magical order, the Hermetic Order of the Golden Dawn was active in Great Britain and focused its practices on theurgy and spiritual development. Many present-day concepts of ritual and magic that are at the centre of contemporary traditions, such as Wicca and Thelema, were inspired by the Golden Dawn, which became one of the largest single influences on 20th-century Western occultism. The three founders, William Robert Woodman, William Wynn Westcott, and Samuel Liddell Mathers, were Freemasons and members of the Societas Rosicruciana in Anglia. Westcott appears to have been the initial driving force behind the establishment of the Golden Dawn. Hence the Golden Dawn system was based on hierarchy and initiation, similar to Masonic lodges. While the grade structure was based on the SRIA, women were admitted on an equal basis with men. The \"Golden Dawn\" was the first of three Orders, although all three are often collectively referred to as the \"Golden Dawn\". The First Order taught esoteric philosophy based on the Hermetic Qabalah and personal development through study and awareness of the four classical elements, as well as the basics of astrology, tarot divination, and geomancy. The Second or Inner Order, t...",
          "sections": [
            {
              "title": "History",
              "content": ""
            },
            {
              "title": "Structure and grades",
              "content": "Much of the hierarchical structure for the Golden Dawn came from the Societas Rosicruciana in Anglia, which was itself derived from the Order of the Golden and Rosy Cross. First Order Neophyte 0=0 Z..."
            },
            {
              "title": "Membership",
              "content": ""
            },
            {
              "title": "Contemporary Golden Dawn orders",
              "content": "While no temples in the original chartered lineage of the Golden Dawn survived past the 1970s, several organizations have since carried on, revived or expanded upon the Order's teachings and rituals, ..."
            },
            {
              "title": "The Golden Dawn book",
              "content": "The Golden Dawn, by Israel Regardie; was published in 1937. The book is divided into several basic sections. First are the knowledge lectures, which describe the basic teaching of the Qabalah, symboli..."
            },
            {
              "title": "See also",
              "content": "AA The Order of the GD (Golden Dawn) Magical organization - Organization for the practice of occult magic Tattva vision - Subject related to ESP"
            }
          ],
          "categories": [
            "Category:1887 establishments in the United Kingdom",
            "Category:1903 disestablishments in the United Kingdom",
            "Category:Articles containing Latin-language text",
            "Category:Articles with short description",
            "Category:CS1: long volume value"
          ],
          "word_count": 2631,
          "summary_word_count": 288,
          "source_type": "wikipedia_api",
          "extraction_success": true
        },
        {
          "title": "Israel Regardie",
          "url": "https://en.wikipedia.org/wiki/Israel_Regardie",
          "summary": "Francis Israel Regardie (; ne Regudy; November 17, 1907 - March 10, 1985) was an English and American occultist, ceremonial magician, and writer who spent much of his life in the United States. He wrote fifteen books on the subject of occultism. Born to a working-class Orthodox Jewish family in the East End of London, Regardie and his family soon moved to Washington, D.C., in the United States. Regardie rejected Orthodox Judaism during his teenage years and took an interest in Theosophy, Hinduis...",
          "full_content": "Francis Israel Regardie (; ne Regudy; November 17, 1907 - March 10, 1985) was an English and American occultist, ceremonial magician, and writer who spent much of his life in the United States. He wrote fifteen books on the subject of occultism. Born to a working-class Orthodox Jewish family in the East End of London, Regardie and his family soon moved to Washington, D.C., in the United States. Regardie rejected Orthodox Judaism during his teenage years and took an interest in Theosophy, Hinduism, Buddhism, and Jewish mysticism. It was through his interest in yoga that he encountered the writings of the occultist Aleister Crowley. Contacting Crowley, he was invited to serve as the occultist's secretary, necessitating a move to Paris, France in 1928. He followed Crowley to England before their association ended. Living in England, he wrote two books on the Qabalah, A Garden of Pomegranates and The Tree of Life. In 1934 he then joined the Stella Matutina-a ceremonial magic order descended from the defunct Hermetic Order of the Golden Dawn-but grew dissatisfied with its leadership and left. He also studied psychology, being particularly influenced by ideas from Jungian psychology, and explored Christian mysticism. In 1937 he returned to the United States. Concerned that the Golden Dawn system of ceremonial magic would be lost, he published the Stella Matutina rituals in a series of books between 1938 and 1940. This entailed breaking his oath of secrecy and brought anger from man...",
          "sections": [
            {
              "title": "Biography",
              "content": ""
            },
            {
              "title": "Personal life",
              "content": "Over the course of his life, Regardie married and divorced three times; he had no children. Regardie suffered from asthma, sometimes known as \"the occultist's disease\" within the occult community. Sus..."
            },
            {
              "title": "Legacy",
              "content": "Regardie is a principal reliable source for much of what is known about the Hermetic Order of the Golden Dawn. His writings and the students he taught or influenced provide much of the foundation for ..."
            },
            {
              "title": "Partial bibliography",
              "content": "A Garden of Pomegranates: an outline of the qabalah (1932) The Tree of Life: a study in magic (1932) The Art of True Healing: the unlimited power of prayer and visualisation (1932) My Rosicrucian Adve..."
            },
            {
              "title": "See also",
              "content": "Books about magic List of occultists"
            },
            {
              "title": "References",
              "content": ""
            }
          ],
          "categories": [
            "Category:1907 births",
            "Category:1985 deaths",
            "Category:Articles with hCards",
            "Category:Articles with short description",
            "Category:English occult writers"
          ],
          "word_count": 3120,
          "summary_word_count": 299,
          "source_type": "wikipedia_api",
          "extraction_success": true
        }
      ],
      "success_count": 2,
      "total_attempted": 3,
      "success_rate": 0.6666666666666666
    },
    "thelema": {
      "tradition_name": "thelema",
      "display_name": "Thelema",
      "extracted_articles": [
        {
          "title": "Thelema",
          "url": "https://en.wikipedia.org/wiki/Thelema",
          "summary": "Thelema () is a Western esoteric and occult social or spiritual philosophy and a new religious movement founded in the early 1900s by Aleister Crowley (1875-1947), an English writer, mystic, occultist, and ceremonial magician. Central to Thelema is the concept of discovering and following one's True Will, a divine and individual purpose that transcends ordinary desires. Crowley's system begins with The Book of the Law, a text he maintained was dictated to him by a non-corporeal entity named Aiwa...",
          "full_content": "Thelema () is a Western esoteric and occult social or spiritual philosophy and a new religious movement founded in the early 1900s by Aleister Crowley (1875-1947), an English writer, mystic, occultist, and ceremonial magician. Central to Thelema is the concept of discovering and following one's True Will, a divine and individual purpose that transcends ordinary desires. Crowley's system begins with The Book of the Law, a text he maintained was dictated to him by a non-corporeal entity named Aiwass. This work outlines key principles, including the axioms \"Do what thou wilt shall be the whole of the Law\" and \"love is the law, love under will\", emphasizing personal freedom and the pursuit of one's true path. The Thelemic cosmology features deities inspired by ancient Egyptian religion. The highest deity is Nuit, the night sky symbolized as a naked woman covered in stars, representing the ultimate source of possibilities. Hadit, the infinitely small point, symbolizes manifestation and motion. Ra-Hoor-Khuit, who is believed to be a form of Horus, represents the Sun and active energies of Thelemic magick. Crowley believed that discovering and following one's True Will is the path to self-realization and personal fulfillment, often referred to as the Great Work. Magick is a central practice in Thelema, involving various physical, mental, and spiritual exercises aimed at uncovering one's True Will and enacting change in alignment with it. Practices such as rituals, yoga, and meditati...",
          "sections": [
            {
              "title": "Historical precedents",
              "content": "The word (thelma) is rare in Classical Greek, where it \"signifies the appetitive will: desire, sometimes even sexual\", but it is frequent in the Septuagint. Early Christian writings occasional..."
            },
            {
              "title": "Beliefs",
              "content": ""
            },
            {
              "title": "Practice",
              "content": "The core of Thelemic thought is \"Do what thou wilt\". However, beyond this, there exists a wide range of interpretation of Thelema. Modern Thelema is a syncretic philosophy and religion, and many Thele..."
            },
            {
              "title": "Post-Crowley developments",
              "content": "Aleister Crowley was highly prolific and wrote on the subject of Thelema for over 35 years, and many of his books remain in print. During his time, there were several others who wrote on the subject, ..."
            },
            {
              "title": "See also",
              "content": "Sri Sabhapati Swami - Indian yoga teacher Wiccan Rede - Wicca moral statement Worship of heavenly bodies - Worship of stars and other heavenly bodies as deities Samuel Liddell MacGregor Mathers - Brit..."
            },
            {
              "title": "Notes",
              "content": ""
            }
          ],
          "categories": [
            "Category:Aleister Crowley",
            "Category:All articles with unsourced statements",
            "Category:Articles containing Ancient Greek (to 1453)-language text",
            "Category:Articles containing French-language text",
            "Category:Articles containing Greek-language text"
          ],
          "word_count": 5970,
          "summary_word_count": 343,
          "source_type": "wikipedia_api",
          "extraction_success": true
        },
        {
          "title": "Aleister Crowley",
          "url": "https://en.wikipedia.org/wiki/Aleister_Crowley",
          "summary": "Aleister Crowley ( AL-ist-r KROH-lee; born Edward Alexander Crowley; 12 October 1875 - 1 December 1947) was an English occultist, ceremonial magician, poet, novelist, mountaineer, and painter. He founded the religion of Thelema, identifying himself as the prophet entrusted with guiding humanity into the on of Horus in the early 20th century. A prolific writer, he published widely over the course of his life. Born to a wealthy family in Royal Leamington Spa, Warwickshire, Crowley rejected his p...",
          "full_content": "Aleister Crowley ( AL-ist-r KROH-lee; born Edward Alexander Crowley; 12 October 1875 - 1 December 1947) was an English occultist, ceremonial magician, poet, novelist, mountaineer, and painter. He founded the religion of Thelema, identifying himself as the prophet entrusted with guiding humanity into the on of Horus in the early 20th century. A prolific writer, he published widely over the course of his life. Born to a wealthy family in Royal Leamington Spa, Warwickshire, Crowley rejected his parents' fundamentalist Christian Plymouth Brethren faith to pursue an interest in Western esotericism. He was educated at Trinity College at the University of Cambridge, where he focused his attention upon mountaineering and poetry, resulting in several publications. Some biographers allege that here he was recruited into a British intelligence agency, further suggesting that he remained a spy throughout his life. In 1898, he joined the esoteric Hermetic Order of the Golden Dawn, where he was trained in ceremonial magic by Samuel Liddell MacGregor Mathers and Allan Bennett. He went mountaineering in Mexico with Oscar Eckenstein, before studying Hindu and Buddhist practices in India. In 1904, he married Rose Edith Kelly, and they honeymooned in Cairo, Egypt, where Crowley wrote down The Book of the Law-a sacred text that serves as the basis for Thelema, which he said had been dictated to him by a supernatural entity named Aiwass. The Book announced the start of the on of Horus, and dec...",
          "sections": [
            {
              "title": "Early life",
              "content": ""
            },
            {
              "title": "Developing Thelema",
              "content": ""
            },
            {
              "title": "Later life",
              "content": ""
            },
            {
              "title": "Beliefs and thought",
              "content": "Crowley's belief system, Thelema, has been described by scholars as a religion, and more specifically as both a new religious movement, and as a \"magico-religious doctrine\". Although holding The Book ..."
            },
            {
              "title": "Image and opinions",
              "content": "Crowley considered himself to be one of the outstanding figures of his time. The historian Ronald Hutton stated that in Crowley's youth, he was \"a self-indulgent and flamboyant young man\" who \"set abo..."
            },
            {
              "title": "Possible links to intelligence",
              "content": "Biographers Richard B. Spence and Tobias Churton have suggested that Crowley was a spy for the British secret services and that among other things he joined the Golden Dawn under their command to moni..."
            }
          ],
          "categories": [
            "Category:1875 births",
            "Category:1947 deaths",
            "Category:19th-century English LGBTQ people",
            "Category:19th-century English poets",
            "Category:19th-century pseudonymous writers"
          ],
          "word_count": 10991,
          "summary_word_count": 511,
          "source_type": "wikipedia_api",
          "extraction_success": true
        },
        {
          "title": "The Book of the Law",
          "url": "https://en.wikipedia.org/wiki/The_Book_of_the_Law",
          "summary": "Liber AL vel Legis (Classical Latin: [lbr a. wllegs]), commonly known as The Book of the Law, is the central sacred text of Thelema. The book is often referred to simply as Liber AL, Liber Legis or just AL, though technically the latter two refer only to the manuscript. Aleister Crowley wrote the Liber AL vel Legis in 1904, saying that the book was dictated to him by a beyond-human being, Aiwass, who he later referred to as his own Holy Guardian Angel. Following positive reception of ...",
          "full_content": "Liber AL vel Legis (Classical Latin: [lbr a. wllegs]), commonly known as The Book of the Law, is the central sacred text of Thelema. The book is often referred to simply as Liber AL, Liber Legis or just AL, though technically the latter two refer only to the manuscript. Aleister Crowley wrote the Liber AL vel Legis in 1904, saying that the book was dictated to him by a beyond-human being, Aiwass, who he later referred to as his own Holy Guardian Angel. Following positive reception of the Book, Crowley proclaimed the arrival of a new stage in the spiritual evolution of humanity, to be known as the \"on of Horus\". The primary precept of this new aeon is the charge, \"Do what thou wilt shall be the whole of the Law.\" The book contains three chapters, each of which Crowley said had been dictated and written down in one hour, beginning at noon, on 8 April, 9 April, and 10 April in Cairo, Egypt, in the year 1904. The three chapters of the book are attributed to the deities Nuit, Hadit, and Ra-Hoor-Khuit. Rose Edith Kelly, Crowley's wife, corrected two phrases in the manuscript. Crowley later wrote that \"Certain very serious questions have arisen with regard to the method by which this Book was obtained. I do not refer to those doubts-real or pretended-which hostility engenders, for all such are dispelled by study of the text; no forger could have prepared so complex a set of numerical and literal puzzles[...]\" Biographer Lawrence Sutin quotes private diaries that fit this...",
          "sections": [
            {
              "title": "Structure and title",
              "content": "The technical title of the book is Liber AL vel Legis, sub figura CCXX, as delivered by XCIII=418 to DCLXVI, although this title never occurs in the Book itself, which refers to itself as \"the Book of..."
            },
            {
              "title": "Creation",
              "content": ""
            },
            {
              "title": "Thelemic interpretations",
              "content": "Thanks in large part to \"The Comment\", the interpretation of the often cryptic text of Liber AL vel Legis is generally considered by Thelemites to be a matter for the individual reader. Crowley devote..."
            },
            {
              "title": "Scholarly analyses",
              "content": "Israel Regardie, former secretary to Crowley, offers a psychological interpretation of The Book of the Law in The Eye in the Triangle. Regardie suggests that the book can be understood as an expressio..."
            },
            {
              "title": "Editions",
              "content": "The Book of the Law was first published in 1909 as part of , a collection of the holy books of Thelema. was privately published in London by the AA as a three volume set, with The Book ..."
            },
            {
              "title": "See also",
              "content": "Aleister Crowley bibliography Liber Pennae Praenumbra"
            }
          ],
          "categories": [
            "Category:1904 non-fiction books",
            "Category:All articles with unsourced statements",
            "Category:Articles that link to Wikisource",
            "Category:Articles with short description",
            "Category:Articles with unsourced statements from February 2022"
          ],
          "word_count": 3777,
          "summary_word_count": 287,
          "source_type": "wikipedia_api",
          "extraction_success": true
        }
      ],
      "success_count": 3,
      "total_attempted": 3,
      "success_rate": 1.0
    },
    "egyptian_magic": {
      "tradition_name": "egyptian_magic",
      "display_name": "Egyptian Magic",
      "extracted_articles": [
        {
          "title": "Ancient Egyptian religion",
          "url": "https://en.wikipedia.org/wiki/Ancient_Egyptian_religion",
          "summary": "Ancient Egyptian religion was a complex system of polytheistic beliefs and rituals that formed an integral part of ancient Egyptian culture. It centered on the Egyptians' interactions with many deities believed to be present and in control of the world. About 1,500 deities are known. Rituals such as prayer and offerings were provided to the gods to gain their favor. Formal religious practice centered on the pharaohs, the rulers of Egypt, believed to possess divine powers by virtue of their posit...",
          "full_content": "Ancient Egyptian religion was a complex system of polytheistic beliefs and rituals that formed an integral part of ancient Egyptian culture. It centered on the Egyptians' interactions with many deities believed to be present and in control of the world. About 1,500 deities are known. Rituals such as prayer and offerings were provided to the gods to gain their favor. Formal religious practice centered on the pharaohs, the rulers of Egypt, believed to possess divine powers by virtue of their positions. They acted as intermediaries between their people and the gods, and were obligated to sustain the gods through rituals and offerings so that they could maintain Ma'at, the order of the cosmos, and repel Isfet, which was chaos. The state dedicated enormous resources to religious rituals and to the construction of temples. Individuals could interact with the gods for their own purposes, appealing for help through prayer or compelling the gods to act through magic. These practices were distinct from, but closely linked with, the formal rituals and institutions. The popular religious tradition grew more prominent over the course of Egyptian history as the status of the pharaoh declined. Egyptian belief in the afterlife and the importance of funerary practices is evident in the great efforts made to ensure the survival of their souls after death - via the provision of tombs, grave goods and offerings to preserve the bodies and spirits of the deceased. The religion had its roots in Egy...",
          "sections": [
            {
              "title": "Beliefs",
              "content": "The beliefs and rituals now referred to as \"ancient Egyptian religion\" were integral within every aspect of Egyptian culture; thus the Egyptian language possessed no single term corresponding to the c..."
            },
            {
              "title": "Writings",
              "content": "While the Egyptians had no unified religious scripture, they produced many religious writings of various types. Together the disparate texts provide an extensive, but still incomplete, understanding o..."
            },
            {
              "title": "Practices",
              "content": ""
            },
            {
              "title": "History",
              "content": ""
            },
            {
              "title": "See also",
              "content": "Index of Egyptian mythology articles Kemeticism Outline of ancient Egypt Prehistoric religion Religions of the ancient Near East"
            },
            {
              "title": "References",
              "content": ""
            }
          ],
          "categories": [
            "Category:All articles with dead external links",
            "Category:All articles with unsourced statements",
            "Category:Ancient Egyptian religion",
            "Category:Articles with dead external links from August 2023",
            "Category:Articles with permanently dead external links"
          ],
          "word_count": 8261,
          "summary_word_count": 390,
          "source_type": "wikipedia_api",
          "extraction_success": true
        },
        {
          "title": "Egyptian mythology",
          "url": "https://en.wikipedia.org/wiki/Egyptian_mythology",
          "summary": "Egyptian mythology is the collection of myths from ancient Egypt, which describe the actions of the Egyptian gods as a means of understanding the world around them. The beliefs that these myths express are an important part of ancient Egyptian religion. Myths appear frequently in Egyptian writings and art, particularly in short stories and in religious material such as hymns, ritual texts, funerary texts, and temple decoration. These sources rarely contain a complete account of a myth and often ...",
          "full_content": "Egyptian mythology is the collection of myths from ancient Egypt, which describe the actions of the Egyptian gods as a means of understanding the world around them. The beliefs that these myths express are an important part of ancient Egyptian religion. Myths appear frequently in Egyptian writings and art, particularly in short stories and in religious material such as hymns, ritual texts, funerary texts, and temple decoration. These sources rarely contain a complete account of a myth and often describe only brief fragments. Inspired by the cycles of nature, the Egyptians saw time in the present as a series of recurring patterns, whereas the earliest periods of time were linear. Myths are set in these earliest times, and myth sets the pattern for the cycles of the present. Present events repeat the events of myth, and in doing so renew maat, the fundamental order of the universe. Amongst the most important episodes from the mythic past are the creation myths, in which the gods form the universe out of primordial chaos; the stories of the reign of the sun god Ra upon the earth; and the Osiris myth, concerning the struggles of the gods Osiris, Isis, and Horus against the disruptive god Set. Events from the present that might be regarded as myths include Ra's daily journey through the world and its otherworldly counterpart, the Duat. Recurring themes in these mythic episodes include the conflict between the upholders of maat and the forces of disorder, the importance of the phar...",
          "sections": [
            {
              "title": "Origins",
              "content": "The development of Egyptian myth is difficult to trace. Egyptologists must make inferences about its earliest phases, based on written sources that appeared much later. One obvious influence on myth i..."
            },
            {
              "title": "Definition and scope",
              "content": "Scholars have difficulty defining which ancient Egyptian beliefs are myths. The basic definition of myth suggested by the Egyptologist John Baines is \"a sacred or culturally central narrative\". In Egy..."
            },
            {
              "title": "Content and meaning",
              "content": "Like myths in many other cultures, Egyptian myths serve to justify human traditions and to address fundamental questions about the world, such as the nature of disorder and the ultimate fate of the un..."
            },
            {
              "title": "Sources",
              "content": "The sources that are available range from solemn hymns to entertaining stories. Without a single, canonical version of any myth, the Egyptians adapted the broad traditions of myth to fit the varied pu..."
            },
            {
              "title": "Cosmology",
              "content": "Egyptian cosmology is analogous to ancient near eastern cosmology, early Greek cosmology, and other cosmological systems, which may be collectively labelled as adhering to a \"cradle cosmology\" model i..."
            },
            {
              "title": "Major myths",
              "content": "Some of the most important categories of myths are described below. Because of the fragmentary nature of Egyptian myths, there is little indication in Egyptian sources of a chronological sequence of m..."
            }
          ],
          "categories": [
            "Category:Articles with short description",
            "Category:CS1 German-language sources (de)",
            "Category:Egyptian mythology",
            "Category:Middle Eastern mythology",
            "Category:Short description is different from Wikidata"
          ],
          "word_count": 8028,
          "summary_word_count": 379,
          "source_type": "wikipedia_api",
          "extraction_success": true
        }
      ],
      "success_count": 2,
      "total_attempted": 3,
      "success_rate": 0.6666666666666666
    },
    "taoism": {
      "tradition_name": "taoism",
      "display_name": "Taoism",
      "extracted_articles": [
        {
          "title": "Taoism",
          "url": "https://en.wikipedia.org/wiki/Taoism",
          "summary": "Taoism or Daoism ( , ) is a philosophical and religious tradition indigenous to China, emphasizing harmony with the Tao (pinyin: dao; Wade-Giles: tao4). With a range of meaning in Chinese philosophy, translations of Tao include 'way', 'road', 'path', or 'technique', generally understood in the Taoist sense as an enigmatic process of transformation ultimately underlying reality. Taoist thought has informed the development of various practices within the Taoist tradition, ideation of mathemati...",
          "full_content": "Taoism or Daoism ( , ) is a philosophical and religious tradition indigenous to China, emphasizing harmony with the Tao (pinyin: dao; Wade-Giles: tao4). With a range of meaning in Chinese philosophy, translations of Tao include 'way', 'road', 'path', or 'technique', generally understood in the Taoist sense as an enigmatic process of transformation ultimately underlying reality. Taoist thought has informed the development of various practices within the Taoist tradition, ideation of mathematics and beyond, including forms of meditation, astrology, qigong, feng shui, and internal alchemy. A common goal of Taoist practice is self-cultivation, a deeper appreciation of the Tao, and more harmonious existence. Taoist ethics vary, but generally emphasize such virtues as effortless action, naturalness, simplicity, and the three treasures of compassion, frugality, and humility. The core of Taoist thought crystallized during the early Warring States period (c.450 - c.300 BCE), during which the epigrammatic Tao Te Ching and the anecdotal Zhuangzi-widely regarded as the fundamental texts of Taoist philosophy-were largely composed. They form the core of a body of Taoist writings accrued over the following centuries, which was assembled by monks into the Daozang canon starting in the 5th century CE. Early Taoism drew upon diverse influences, including the Shang and Zhou state religions, Naturalism, Mohism, Confucianism, various Legalist theories, as well as the I Ching and Spring and ...",
          "sections": [
            {
              "title": "Terminology",
              "content": ""
            },
            {
              "title": "History",
              "content": ""
            },
            {
              "title": "Teachings",
              "content": ""
            },
            {
              "title": "Practices",
              "content": "Some key elements of Taoist practice include a commitment to self-cultivation, wu wei, and attunement to the patterns of the Tao.The practice of Taoism seeks to develop the body back to its original l..."
            },
            {
              "title": "Texts",
              "content": "Some religious Taoist movements view traditional texts as scriptures that are considered sacred, authoritative, binding, and divinely inspired or revealed. However, the Tao Te Ching was originally vie..."
            },
            {
              "title": "Symbols and images",
              "content": "The taijitu, commonly known as the \"yin and yang symbol\" or simply the \"yin-yang\", and the bagua are important symbols in Taoism because they represent key elements of Taoist cosmology (see above). Ma..."
            }
          ],
          "categories": [
            "Category:All Wikipedia articles written in American English",
            "Category:All articles with dead external links",
            "Category:All articles with failed verification",
            "Category:All articles with self-published sources",
            "Category:All articles with unsourced statements"
          ],
          "word_count": 17208,
          "summary_word_count": 538,
          "source_type": "wikipedia_api",
          "extraction_success": true
        },
        {
          "title": "Tao",
          "url": "https://en.wikipedia.org/wiki/Tao",
          "summary": "The Tao or Dao is the natural way of the universe, primarily as conceived in East Asian philosophy and religion. This seeing of life cannot be grasped as a concept. Rather, it is seen through actual living experience of one's everyday being. The concept is represented by the Chinese character , which has meanings including 'way', 'path', 'road', and sometimes 'doctrine' or 'principle'. In the Tao Te Ching, the ancient philosopher Laozi explains that the Tao is not a name for a thing, but the un...",
          "full_content": "The Tao or Dao is the natural way of the universe, primarily as conceived in East Asian philosophy and religion. This seeing of life cannot be grasped as a concept. Rather, it is seen through actual living experience of one's everyday being. The concept is represented by the Chinese character , which has meanings including 'way', 'path', 'road', and sometimes 'doctrine' or 'principle'. In the Tao Te Ching, the ancient philosopher Laozi explains that the Tao is not a name for a thing, but the underlying natural order of the universe whose ultimate essence is difficult to circumscribe because it is non-conceptual yet evident in one's being of aliveness. The Tao is \"eternally nameless\" and should be distinguished from the countless named things that are considered to be its manifestations, the reality of life before its descriptions of it. Description and uses of the concept The word \"Tao\" has a variety of meanings in both the ancient and modern Chinese language. Aside from its purely prosaic use meaning road, channel, path, principle, or similar, the word has acquired a variety of differing and often confusing metaphorical, philosophical, and religious uses. In most belief systems, the word is used symbolically in its sense of \"way\" as the right or proper way of existence, or in the context of ongoing practices of attainment or of the full coming into being, or the state of enlightenment or spiritual perfection that is the outcome of such practices. Some scholars make sharp d...",
          "sections": [
            {
              "title": "Description and uses of the concept",
              "content": "The word \"Tao\" has a variety of meanings in both the ancient and modern Chinese language. Aside from its purely prosaic use meaning road, channel, path, principle, or similar, the word has acquired a ..."
            },
            {
              "title": "Interpretations",
              "content": ""
            },
            {
              "title": "Linguistic aspects",
              "content": "The Chinese character is highly polysemous: its historical alternate pronunciation as do possessed an additional connotation of 'guide'. The history of the character includes details of orthography..."
            },
            {
              "title": "See also",
              "content": "Asha Brahman Absolute (philosophy) Nu (mythology) Wuji (philosophy) Manitou Logos"
            },
            {
              "title": "Notes",
              "content": ""
            },
            {
              "title": "References",
              "content": ""
            }
          ],
          "categories": [
            "Category:All articles with unsourced statements",
            "Category:Ancient Chinese philosophy",
            "Category:Articles containing Ancient Greek (to 1453)-language text",
            "Category:Articles containing Chinese-language text",
            "Category:Articles containing Japanese-language text"
          ],
          "word_count": 4627,
          "summary_word_count": 139,
          "source_type": "wikipedia_api",
          "extraction_success": true
        },
        {
          "title": "Wu wei",
          "url": "https://en.wikipedia.org/wiki/Wu_wei",
          "summary": "Wu wei (traditional Chinese: ; simplified Chinese: ; pinyin: wuwei) is a polysemous, ancient Chinese concept expressing an ideal practice of \"inaction\", \"inexertion\" or \"effortless action\", as a state of personal harmony and free-flowing, spontaneous creative manifestation. In a political context, it also refers to an ideal form or principle of governance or government. Wu wei appears as an idea as early as the Spring and Autumn period, with early literary examples in the Classic of Poetry....",
          "full_content": "Wu wei (traditional Chinese: ; simplified Chinese: ; pinyin: wuwei) is a polysemous, ancient Chinese concept expressing an ideal practice of \"inaction\", \"inexertion\" or \"effortless action\", as a state of personal harmony and free-flowing, spontaneous creative manifestation. In a political context, it also refers to an ideal form or principle of governance or government. Wu wei appears as an idea as early as the Spring and Autumn period, with early literary examples in the Classic of Poetry. It became an important concept in the Confucian Analects, linking a Confucian ethic of practical morality to a state of being harmonizing intention and action. It would go on to become a central concept in Legalist statecraft and Daoism, in Daoism as a concept emphasizing alignment with the natural Dao in actions and intentions, avoiding force or haste against the natural order. Sinologist Jean Francois Billeter describes wu-wei as a \"state of perfect knowledge (understanding) of the coexistence of the situation and perceiver, perfect efficaciousness and the realization of a perfect economy of energy\". Early scholarship The early scholarship of Feng Youlan suggested a distinction between philosophical and religious Daoism. Following him, sinologist Herrlee G. Creel took a \"contemplative Daoism\" as coming first, and \"purposive Daoism\" second. Creel took wu wei as found in the Zhuangzi and Daodejing as denoting two different things: An \"attitude of genuine non-action, motivated by a ...",
          "sections": [
            {
              "title": "Early scholarship",
              "content": "The early scholarship of Feng Youlan suggested a distinction between philosophical and religious Daoism. Following him, sinologist Herrlee G. Creel took a \"contemplative Daoism\" as coming first, and ..."
            },
            {
              "title": "Confucian development",
              "content": "Sinologist Roger T. Ames regards attempts to determine the origin of wu wei as strained speculation. But while Shen Buhai bears a \"striking\" resemblance to the Tao te Ching, it would still be difficul..."
            },
            {
              "title": "Daoist development",
              "content": "Following its developments elsewhere, Zhuang Zhou and Laozi turn towards an unadorned \"no effort\". Laozi, as opposed to carved Confucian jade, advocates a return to the primordial Mother and to become..."
            },
            {
              "title": "Wuwei in Chan Buddhism",
              "content": "In early Chinese Buddhism, wuwei was used as a translation of nirva, which was understood to be unproduced and inactive. Although this translation was eventually abandoned in favor of niepan, a phon..."
            },
            {
              "title": "In political theory",
              "content": "Unable to find his philosopher-king, Confucius placed his hope in virtuous ministers. Apart from the Confucian ruler's \"divine essence\" (ling) \"ensuring the fecundity of his people\" and fertility of t..."
            },
            {
              "title": "Modern",
              "content": "Philosopher Alan Watts believed that wu wei can be described as \"not-forcing.\" Watts also understood wu wei as \"the art of getting out of ones own way\" and offered the following illustration: \"The ri..."
            }
          ],
          "categories": [
            "Category:All articles that are excessively detailed",
            "Category:All articles that are too technical",
            "Category:All articles with style issues",
            "Category:Articles containing Chinese-language text",
            "Category:Articles containing Japanese-language text"
          ],
          "word_count": 5994,
          "summary_word_count": 171,
          "source_type": "wikipedia_api",
          "extraction_success": true
        }
      ],
      "success_count": 3,
      "total_attempted": 3,
      "success_rate": 1.0
    },
    "i_ching": {
      "tradition_name": "i_ching",
      "display_name": "I Ching",
      "extracted_articles": [
        {
          "title": "I Ching",
          "url": "https://en.wikipedia.org/wiki/I_Ching",
          "summary": "The I Ching, or Yijing (Chinese: Mandarin pronunciation:[i ti] ), usually translated Book of Changes or Classic of Changes, is an ancient Chinese divination text that is among the oldest of the Chinese classics. The I Ching was originally a divination manual in the Western Zhou period (1000-750 BC). Over the course of the Warring States and early imperial periods (500-200 BC), it transformed into a cosmological text with a series of philosophical commentaries known as the Ten Wings. After ...",
          "full_content": "The I Ching, or Yijing (Chinese: Mandarin pronunciation:[i ti] ), usually translated Book of Changes or Classic of Changes, is an ancient Chinese divination text that is among the oldest of the Chinese classics. The I Ching was originally a divination manual in the Western Zhou period (1000-750 BC). Over the course of the Warring States and early imperial periods (500-200 BC), it transformed into a cosmological text with a series of philosophical commentaries known as the Ten Wings. After becoming part of the Chinese Five Classics in the 2nd century BC, the I Ching served as the foundation for divinatory practices for centuries across the Far East and was the subject of scholarly commentary. Between the 18th and 20th centuries, it took on an influential role in Western understanding of East Asian philosophical thought. As a divination text, the I Ching is used for a Chinese form of cleromancy known as I Ching divination in which bundles of yarrow stalks are manipulated to produce sets of six apparently random numbers ranging from 6 to 9. Each of the 64 possible sets corresponds to a hexagram, which can be looked up in the I Ching. The hexagrams are arranged in an order known as the King Wen sequence. The interpretation of the readings found in the I Ching has been discussed and debated over the centuries. Many commentators have used the book symbolically, often to provide guidance for moral decision-making, as informed by Confucianism, Taoism and Buddhism. The hexagrams...",
          "sections": [
            {
              "title": "The divination text: Zhou Yi",
              "content": ""
            },
            {
              "title": "The classic: I Ching",
              "content": "In 136 BC, Emperor Wu of Han named the Zhou yi \"the first among the classics\", dubbing it the Classic of Changes or I Ching. Emperor Wu's placement of the I Ching among the Five Classics was informed ..."
            },
            {
              "title": "Hexagrams",
              "content": "In the canonical I Ching, the hexagrams are arranged in an order dubbed the King Wen sequence after King Wen of Zhou, who founded the Zhou dynasty and supposedly reformed the method of interpretation...."
            },
            {
              "title": "Interpretation and influence",
              "content": "The sinologist Michael Nylan describes the I Ching as the best-known Chinese book in the world. Eliot Weinberger wrote that it is the most \"recognized\" Chinese book. In East Asia, it is a foundational..."
            },
            {
              "title": "Translations",
              "content": "The I Ching has been translated into Western languages dozens of times. The earliest published complete translation of the I Ching into a Western language was a Latin translation done in the 1730s by ..."
            },
            {
              "title": "See also",
              "content": "Lingqijing Luoshu Square Qimen Dunjia Taixuanjing"
            }
          ],
          "categories": [
            "Category:1st-millennium BC books",
            "Category:Articles containing Chinese-language text",
            "Category:Articles containing Japanese-language text",
            "Category:Articles containing Korean-language text",
            "Category:Articles containing Latin-language text"
          ],
          "word_count": 4646,
          "summary_word_count": 276,
          "source_type": "wikipedia_api",
          "extraction_success": true
        },
        {
          "title": "Hexagram (I Ching)",
          "url": "https://en.wikipedia.org/wiki/Hexagram_(I_Ching)",
          "summary": "The I Ching book consists of 64 hexagrams. A hexagram in this context is a figure composed of six stacked horizontal lines ( yao), where each line is either Yang (an unbroken, or solid line), or Yin (broken, an open line with a gap in the center). The hexagram lines are traditionally counted from the bottom up, so the lowest line is considered line one while the top line is line six. Hexagrams are formed by combining the original eight trigrams in different combinations. Each hexagram is accom...",
          "full_content": "The I Ching book consists of 64 hexagrams. A hexagram in this context is a figure composed of six stacked horizontal lines ( yao), where each line is either Yang (an unbroken, or solid line), or Yin (broken, an open line with a gap in the center). The hexagram lines are traditionally counted from the bottom up, so the lowest line is considered line one while the top line is line six. Hexagrams are formed by combining the original eight trigrams in different combinations. Each hexagram is accompanied with a description, often cryptic, akin to parables. Each line in every hexagram is also given a similar description. The Chinese word for a hexagram is \"gua\", although that also means trigram. Types Classic and modern I Ching commentaries mention a number of different hexagram types: Eight Trigrams Original Hexagram Future Hexagram Contrasting (Reverse) Hexagram (is found by turning a hexagram upside down) Complementary Hexagram (is found by changing all the lines into their opposite) Hexagram of Sequence Nuclear (Mutual) Hexagram (hu gua) (is found by taking the inner lines of a hexagram; given that the original hexagram's lines are labeled 1 through 6 from bottom up, the nuclear hexagram contains the lines 2, 3, 4, 3, 4, 5) Hexagram of Change (bian gua) Internal Hexagram (nei gua) External Hexagram (wai gua) Sequences The most commonly known sequence is the King Wen sequence. A totally different sequence was found in the Mawangdui Silk Texts. The hexagrams are also found...",
          "sections": [
            {
              "title": "Types",
              "content": "Classic and modern I Ching commentaries mention a number of different hexagram types: Eight Trigrams Original Hexagram Future Hexagram Contrasting (Reverse) Hexagram (is found by turning a hexagram u..."
            },
            {
              "title": "Sequences",
              "content": "The most commonly known sequence is the King Wen sequence. A totally different sequence was found in the Mawangdui Silk Texts. The hexagrams are also found in the Binary sequence, also known as Fu Xi ..."
            },
            {
              "title": "Lookup table",
              "content": ""
            },
            {
              "title": "See also",
              "content": "List of hexagrams of the I Ching Binary numbers Feng shui Tai Yi Shen Shu Tie Ban Shen Shu"
            },
            {
              "title": "References",
              "content": ""
            },
            {
              "title": "External links",
              "content": "I Ching AI Hexagrams Provides an AI - adapted version of classic text"
            }
          ],
          "categories": [
            "Category:All articles needing additional references",
            "Category:Articles needing additional references from July 2021",
            "Category:Articles with short description",
            "Category:I Ching",
            "Category:Short description is different from Wikidata"
          ],
          "word_count": 301,
          "summary_word_count": 121,
          "source_type": "wikipedia_api",
          "extraction_success": true
        },
        {
          "title": "Yin and yang",
          "url": "https://en.wikipedia.org/wiki/Yin_and_yang",
          "summary": "Originating in Chinese philosophy, yin and yang (English: , ), also yinyang or yin-yang, is the concept of opposite cosmic principles or forces that interact, interconnect, and perpetuate each other. Yin and yang can be thought of as complementary and at the same time opposing forces that together form a dynamic system in which the whole is greater than the assembled parts and the parts are essential for the cohesion of the whole. In Chinese cosmology, the universe creates itself out of a primar...",
          "full_content": "Originating in Chinese philosophy, yin and yang (English: , ), also yinyang or yin-yang, is the concept of opposite cosmic principles or forces that interact, interconnect, and perpetuate each other. Yin and yang can be thought of as complementary and at the same time opposing forces that together form a dynamic system in which the whole is greater than the assembled parts and the parts are essential for the cohesion of the whole. In Chinese cosmology, the universe creates itself out of a primary chaos of primordial qi or material energy, organized into the cycles of yin and yang, force and motion leading to form and matter. \"Yin\" is retractive, passive and contractive in nature, while \"yang\" is repelling, active and expansive in principle; this dichotomy in some form, is seen in all things in nature-patterns of change and difference. For example, biological, psychological and seasonal cycles, the historical evolution of landscapes over days, weeks, years to eons. The original meaning of Yin was depicted as the northerly shaded side of a hill and Yang being the bright southerly aspect. When pertaining to human gender Yin is associated to more rounded feminine characteristics and traits and Yang as sharp and masculine. Taiji is a Chinese cosmological term for the \"Supreme Ultimate\" state of undifferentiated absolute and infinite potential, the oneness before duality, from which yin and yang originate. It can be contrasted with the older wuji (; 'without pole'). In the cosmol...",
          "sections": [
            {
              "title": "Linguistic aspects",
              "content": ""
            },
            {
              "title": "History",
              "content": "Joseph Needham discusses yin and yang together with Five Elements as part of the School of Naturalists. He says that it would be proper to begin with yin and yang before Five Elements because the form..."
            },
            {
              "title": "Nature",
              "content": "Yin and yang are a concept that originated in ancient Chinese philosophy that describes how opposite or contrary forces may create each other by their comparison and are to be seen as actually complem..."
            },
            {
              "title": "Modern usage",
              "content": "Yin is the black side, and yang is the white side. Other color arrangements have included the white of yang being replaced by red. The taijitu is sometimes accompanied by other shapes, such as bagua. ..."
            },
            {
              "title": "See also",
              "content": ""
            },
            {
              "title": "Notes",
              "content": ""
            }
          ],
          "categories": [
            "Category:All articles needing additional references",
            "Category:All articles with unsourced statements",
            "Category:Articles containing Chinese-language text",
            "Category:Articles containing Japanese-language text",
            "Category:Articles containing Korean-language text"
          ],
          "word_count": 2451,
          "summary_word_count": 517,
          "source_type": "wikipedia_api",
          "extraction_success": true
        }
      ],
      "success_count": 3,
      "total_attempted": 3,
      "success_rate": 1.0
    },
    "kuji_kiri": {
      "tradition_name": "kuji_kiri",
      "display_name": "Kuji Kiri",
      "extracted_articles": [
        {
          "title": "Kuji-in",
          "url": "https://en.wikipedia.org/wiki/Kuji-in",
          "summary": "The kuji-in (Japanese: ) or jiziyin (Chinese: ), also known as Nine Hand Seals, is a system of mudras and associated mantras that consist of nine syllables. The mantras are referred to as kuji (Japanese: ), which literally translates as nine characters. The syllables used in kuji are numerous, especially within Japanese esoteric Mikky. Scholars have stated that kuji is of Taoist origin, not Buddhist. There is no mention of the kuji in any of the Buddhist Shingon or Buddhist Tendai reco...",
          "full_content": "The kuji-in (Japanese: ) or jiziyin (Chinese: ), also known as Nine Hand Seals, is a system of mudras and associated mantras that consist of nine syllables. The mantras are referred to as kuji (Japanese: ), which literally translates as nine characters. The syllables used in kuji are numerous, especially within Japanese esoteric Mikky. Scholars have stated that kuji is of Taoist origin, not Buddhist. There is no mention of the kuji in any of the Buddhist Shingon or Buddhist Tendai records that Japan imported. The use of kuji is essentially a layman's practice and is uncommon in many orthodox Buddhist traditions. It is, however, found extensively in Shugend, the ascetic mountain tradition of Japan and Rybu Shint, which is the result of blending Shingon Buddhism and Shinto. The nine Buddhist cuts in order are: Rin, Pyo, To, Sha, Kai, Jin, Retsu, Zai, and Zen. History The kuji are first introduced in the Baopz (Chinese: ), a Chinese Taoist text written by Ge Hong c. 280-340 CE). He introduces the kuji in chapter 17, entitled Dngshe (; lit. \"Climbing [mountains] and crossing [rivers]), as a prayer to the Liuji (; Six Generals), ancient Taoist gods. In Daoist Magic, the Ji are powerful celestial guardians and are among the gods of the Celestial Thunder Court of Emperor Xuanwu. The kuji are first seen in line 5 which reads, Translation: To enter a famous mountain, choo...",
          "sections": [
            {
              "title": "History",
              "content": "The kuji are first introduced in the Baopz (Chinese: ), a Chinese Taoist text written by Ge Hong c. 280-340 CE). He introduces the kuji in chapter 17, entitled Dngshe (; lit. \"Climbing [mounta..."
            },
            {
              "title": "Ryobu kuji",
              "content": "The earliest known Japanese application of the kuji comes from the Shingon monk Kakuban (1095-1143 CE) who was an academic of Taluan's writings and teachings. Kakuban introduced several kuji formulas ..."
            },
            {
              "title": "Variations on the rybu kuji",
              "content": "There are numerous variations of the nine original Taoist kuji in Japanese Buddhism. Most of these variations occurred well after the introduction of the kuji into Japan. Some, however, are other Taoi..."
            },
            {
              "title": "Significance of the number nine",
              "content": "Why the number nine is used has also been of concern to some. The number nine is seen in Taoist divination as the perfect number for yang/yo, the bright side when determining the individual hexagram..."
            },
            {
              "title": "Kuji no in (Hand seals of the Nine Syllables)",
              "content": "The Kuji-in (), Nine Hand Seals, refers to the mudra (hand seals/gestures) associated with the nine syllables themselves, whereas kuji-ho refers to the entire ritual of kuji and encompasses the m..."
            },
            {
              "title": "Yin/Yang and kuji",
              "content": "The dualistic influence of inyogoku (yin yang dualism) is apparent only in respects to the mudra of certain kuji rituals. As stated earlier the kuji in and of itself is a simple prayer. The obvious in..."
            }
          ],
          "categories": [
            "Category:All articles needing rewrite",
            "Category:All articles that may contain original research",
            "Category:All articles with topics of unclear notability",
            "Category:All articles with unsourced statements",
            "Category:Articles containing Chinese-language text"
          ],
          "word_count": 5948,
          "summary_word_count": 145,
          "source_type": "wikipedia_api",
          "extraction_success": true
        },
        {
          "title": "Mudra",
          "url": "https://en.wikipedia.org/wiki/Mudra",
          "summary": "A mudra ( ; Sanskrit: , IAST: mudr, \"seal\", \"mark\", or \"gesture\"; Tibetan: , THL: chakgya) is a symbolic or ritual gesture or pose in Hinduism, Jainism and Buddhism. While some mudras involve the entire body, most are performed with the hands and fingers. As well as being spiritual gestures employed in the iconography and spiritual practice of Indian religions, mudras have meaning in many forms of Indian dance, and yoga. The range of mudras used in each field (and religion) diffe...",
          "full_content": "A mudra ( ; Sanskrit: , IAST: mudr, \"seal\", \"mark\", or \"gesture\"; Tibetan: , THL: chakgya) is a symbolic or ritual gesture or pose in Hinduism, Jainism and Buddhism. While some mudras involve the entire body, most are performed with the hands and fingers. As well as being spiritual gestures employed in the iconography and spiritual practice of Indian religions, mudras have meaning in many forms of Indian dance, and yoga. The range of mudras used in each field (and religion) differs, but with some overlap. In addition, many of the Buddhist mudras are used outside South Asia, and have developed different local forms elsewhere. In hatha yoga, mudras are used in conjunction with pranayama (yogic breathing exercises), generally while in a seated posture, to stimulate different parts of the body involved with breathing and to affect the flow of prana. It is also associated with bindu, bodhicitta, amrita, or consciousness in the body. Unlike older tantric mudras, hatha yogic mudras are generally internal actions, involving the pelvic floor, diaphragm, throat, eyes, tongue, anus, genitals, abdomen, and other parts of the body. Examples of this diversity of mudras are Mula Bandha, Mahamudra, Viparita Karani, Khecar mudr, and Vajroli mudra. These expanded in number from 3 in the Amritasiddhi, to 25 in the Gheranda Samhita, with a classical set of ten arising in the Hatha Yoga Pradipika. Mudra is used in the iconography of Hindu and Buddhist art of the Indian subconti...",
          "sections": [
            {
              "title": "Etymology and nomenclature",
              "content": "The word mudr has Sanskrit roots. According to scholar Sir Monier Monier-Williams it means \"seal\" or \"any other instrument used for sealing\"."
            },
            {
              "title": "Buddhist iconography",
              "content": "A Buddha image can have one of several common mudras, combined with different asanas. The main mudras used represent specific moments in the life of the Buddha, and are shorthand depictions of these."
            },
            {
              "title": "Indian classical dance",
              "content": "In Indian classical dance and derived dances (such as Khmer, Thai or Balinese), the term \"Hasta Mudra\" is used (however, there are terms used for mudras in derived dances such as \"Kayvikear Dai\" in Kh..."
            },
            {
              "title": "Yoga",
              "content": "The classical sources for the yogic seals are the Gheranda Samhita and the Hatha Yoga Pradipika. The Hatha Yoga Pradipika states the importance of mudras in yoga practice: \"Therefore the [Kundalini] g..."
            },
            {
              "title": "Martial arts",
              "content": "Some Asian martial arts forms contain positions (Japanese: in) identical to these mudras. Tendai and Shingon Buddhism derived the supposedly powerful gestures from Mikkyo Buddhism, still to be found i..."
            },
            {
              "title": "See also",
              "content": "Chironomia Gesticulation in Italian Iconography of Gautama Buddha in Laos and Thailand Kuji-in Kuji-kiri List of mudras (dance) List of mudras (yoga) Mahamudra Naga Prok attitude Pranahuti Pranma Ref..."
            }
          ],
          "categories": [
            "Category:All articles with unsourced statements",
            "Category:Articles containing Chinese-language text",
            "Category:Articles containing Sanskrit-language text",
            "Category:Articles containing Standard Tibetan-language text",
            "Category:Articles with short description"
          ],
          "word_count": 2520,
          "summary_word_count": 355,
          "source_type": "wikipedia_api",
          "extraction_success": true
        },
        {
          "title": "Ninjutsu",
          "url": "https://en.wikipedia.org/wiki/Ninjutsu",
          "summary": "Ninjutsu (; [i.d.ts]), shinobi no jutsu (; [i.no.bi no d.ts]) and ninp (; [im.po]) are terms for the techniques and skills used by spies and scouts in pre-modern Japan known as ninja. Some of these techniques are recorded in ninja scrolls, some which have been published and translated. The study of these scrolls have changed the perception of ninja and ninjutsu. While there are martial arts schools that claim to be modern styles of ninjutsu, the historical lineage of thes...",
          "full_content": "Ninjutsu (; [i.d.ts]), shinobi no jutsu (; [i.no.bi no d.ts]) and ninp (; [im.po]) are terms for the techniques and skills used by spies and scouts in pre-modern Japan known as ninja. Some of these techniques are recorded in ninja scrolls, some which have been published and translated. The study of these scrolls have changed the perception of ninja and ninjutsu. While there are martial arts schools that claim to be modern styles of ninjutsu, the historical lineage of these styles only go as far back as the 1950s. Training The skills required of the ninja have come to be known in modern times as ninjutsu (), but it is unlikely they were previously named under a single discipline, rather distributed among a variety of espionage and survival skills. Some view ninjutsu as evidence that ninja were not simple mercenaries because texts contained not only information on combat training, but also information about daily needs, which even included mining techniques. The guidance provided for daily work also included elements that enable the ninja to understand the martial qualities of even the most menial task. These factors show how the ninjutsu established among the ninja class the fundamental principle of adaptation. The first specialized training began in the mid-15th century, when certain samurai families started to focus on covert warfare, including espionage and assassination. According to Turnbull, the ninja was trained from childhood, as was also co...",
          "sections": [
            {
              "title": "Training",
              "content": "The skills required of the ninja have come to be known in modern times as ninjutsu (), but it is unlikely they were previously named under a single discipline, rather distributed among a variety of ..."
            },
            {
              "title": "Equipment",
              "content": "Ninja used a large variety of tools and weaponry, some of which were commonly known, but others were more specialized. Most were tools used in the infiltration of castles. A wide range of specialized ..."
            },
            {
              "title": "Legendary abilities",
              "content": "Perceived control over the elements may be grounded in real tactics, which were categorized by association with forces of nature. For example, the practice of starting fires to cover a ninja's trail f..."
            },
            {
              "title": "See also",
              "content": "Kunoichi Ninjas in popular culture"
            },
            {
              "title": "References",
              "content": ""
            },
            {
              "title": "Further reading",
              "content": "Bertrand, John (2006). \"Techniques that made ninjas feared in 15th-century Japan still set the standard for covert ops\". Military History. 23 (1): 12-19. Cummins, Antony. The Book of Ninja: The Banse..."
            }
          ],
          "categories": [
            "Category:All articles with incomplete citations",
            "Category:All articles with unsourced statements",
            "Category:Articles containing Japanese-language text",
            "Category:Articles with incomplete citations from January 2025",
            "Category:Articles with short description"
          ],
          "word_count": 2331,
          "summary_word_count": 89,
          "source_type": "wikipedia_api",
          "extraction_success": true
        }
      ],
      "success_count": 3,
      "total_attempted": 3,
      "success_rate": 1.0
    },
    "classical_philosophy": {
      "tradition_name": "classical_philosophy",
      "display_name": "Classical Philosophy",
      "extracted_articles": [
        {
          "title": "Ancient Greek philosophy",
          "url": "https://en.wikipedia.org/wiki/Ancient_Greek_philosophy",
          "summary": "Ancient Greek philosophy arose in the 6th century BC. Philosophy was used to make sense of the world using reason. It dealt with a wide variety of subjects, including astronomy, epistemology, mathematics, political philosophy, ethics, metaphysics, ontology, logic, biology, rhetoric and aesthetics. Greek philosophy continued throughout the Hellenistic period and later evolved into Roman philosophy. Greek philosophy has influenced much of Western culture since its inception, and can be found in ma...",
          "full_content": "Ancient Greek philosophy arose in the 6th century BC. Philosophy was used to make sense of the world using reason. It dealt with a wide variety of subjects, including astronomy, epistemology, mathematics, political philosophy, ethics, metaphysics, ontology, logic, biology, rhetoric and aesthetics. Greek philosophy continued throughout the Hellenistic period and later evolved into Roman philosophy. Greek philosophy has influenced much of Western culture since its inception, and can be found in many aspects of public education. Alfred North Whitehead once claimed: \"The safest general characterization of the European philosophical tradition is that it consists of a series of footnotes to Plato\". Clear, unbroken lines of influence lead from ancient Greek and Hellenistic philosophers to Roman philosophy, early Islamic philosophy, medieval scholasticism, the European Renaissance and the Age of Enlightenment. Greek philosophy was influenced to some extent by the older wisdom literature and mythological cosmogonies of the ancient Near East, though the extent of this influence is widely debated. The classicist Martin Litchfield West states, \"contact with oriental cosmology and theology helped to liberate the early Greek philosophers' imagination; it certainly gave them many suggestive ideas. But they taught themselves to reason. Philosophy as we understand it is a Greek creation\". Subsequent philosophic tradition was so influenced by Socrates as presented by Plato that it is conventio...",
          "sections": [
            {
              "title": "Early Greek philosophy (or pre-Socratic philosophy)",
              "content": "The convention of terming those philosophers who were active prior to the death of Socrates as the pre-Socratics gained currency with the 1903 publication of Hermann Diels' Fragmente der Vorsokratiker..."
            },
            {
              "title": "Classical Greek philosophy",
              "content": ""
            },
            {
              "title": "Hellenistic philosophy",
              "content": "During the Hellenistic and Roman periods, many different schools of thought developed in the Hellenistic world and then the Greco-Roman world. The spread of Christianity throughout the Roman world, fo..."
            },
            {
              "title": "Transmission of Greek philosophy in the medieval period",
              "content": "During the Middle Ages, Greek ideas were largely forgotten in Western Europe due to the decline in literacy during the Migration Period. In the Byzantine Empire, however, Greek ideas were preserved an..."
            },
            {
              "title": "See also",
              "content": "Ancient philosophy Byzantine philosophy Definitions of philosophy English words of Greek origin International scientific vocabulary List of ancient Greek philosophers Translingualism Transliteration o..."
            },
            {
              "title": "Notes",
              "content": ""
            }
          ],
          "categories": [
            "Category:Ancient Greek philosophy",
            "Category:Ancient philosophy by culture",
            "Category:Articles with short description",
            "Category:Commons category link from Wikidata",
            "Category:Pages using sidebar with the child parameter"
          ],
          "word_count": 5510,
          "summary_word_count": 250,
          "source_type": "wikipedia_api",
          "extraction_success": true
        },
        {
          "title": "Neoplatonism",
          "url": "https://en.wikipedia.org/wiki/Neoplatonism",
          "summary": "Neoplatonism is a version of Platonic philosophy that emerged in the 3rd century AD against the background of Hellenistic philosophy and religion. The term does not encapsulate a set of ideas as much as a series of thinkers. Among the common ideas it maintains is monism, the doctrine that all of reality can be derived from a single principle, \"the One\". Neoplatonism began with Ammonius Saccas and his student Plotinus (c. 204/5 - 271 AD) and stretched to the sixth century. After Plotinus there w...",
          "full_content": "Neoplatonism is a version of Platonic philosophy that emerged in the 3rd century AD against the background of Hellenistic philosophy and religion. The term does not encapsulate a set of ideas as much as a series of thinkers. Among the common ideas it maintains is monism, the doctrine that all of reality can be derived from a single principle, \"the One\". Neoplatonism began with Ammonius Saccas and his student Plotinus (c. 204/5 - 271 AD) and stretched to the sixth century. After Plotinus there were three distinct periods in the history of neoplatonism: the work of his student Porphyry (third to early fourth century); that of Iamblichus (third to fourth century); and the period in the fifth and sixth centuries, when the academies in Alexandria and Athens flourished. Neoplatonism had an enduring influence on the subsequent history of Western philosophy and religion. In the Middle Ages, Neoplatonic ideas were studied and discussed by Christian, Jewish, and Muslim thinkers. In the Islamic cultural sphere, Neoplatonic texts were available in Arabic and Persian translations, and notable philosophers such as al-Farabi, Solomon ibn Gabirol (Avicebron), Avicenna (Ibn Sina), and Maimonides incorporated Neoplatonic elements into their own thinking. Christian philosopher and theologian Thomas Aquinas (1225-1274) had direct access to the works of Proclus, Simplicius of Cilicia, and Pseudo-Dionysius the Areopagite, and he knew about other neoplatonists, such as Plotinus and Porphyry, throu...",
          "sections": [
            {
              "title": "Origins of the term",
              "content": "Neoplatonism is a modern term. The term neoplatonism has a double function as a historical category. On the one hand, it differentiates the philosophical doctrines of Plotinus and his successors from ..."
            },
            {
              "title": "Origins and history of classical Neoplatonism",
              "content": "Neoplatonism started with Plotinus in the 3rd century AD. Three distinct phases in classical neoplatonism after Plotinus can be distinguished: the work of his student Porphyry; that of Iamblichus and ..."
            },
            {
              "title": "Ideas",
              "content": "The Enneads of Plotinus are the primary and classical document of neoplatonism. As a form of mysticism, it contains theoretical and practical parts. The theoretical parts deal with the high origin of ..."
            },
            {
              "title": "Influence",
              "content": ""
            },
            {
              "title": "See also",
              "content": ""
            },
            {
              "title": "Notes",
              "content": ""
            }
          ],
          "categories": [
            "Category:All articles to be expanded",
            "Category:All articles with unsourced statements",
            "Category:Articles to be expanded from September 2024",
            "Category:Articles with Internet Encyclopedia of Philosophy links",
            "Category:Articles with LibriVox links"
          ],
          "word_count": 5053,
          "summary_word_count": 290,
          "source_type": "wikipedia_api",
          "extraction_success": true
        },
        {
          "title": "Hermeticism",
          "url": "https://en.wikipedia.org/wiki/Hermeticism",
          "summary": "Hermeticism, or Hermetism, is a philosophical and religious tradition rooted in the teachings attributed to Hermes Trismegistus, a syncretic figure combining elements of the Greek god Hermes and the Egyptian god Thoth. This system encompasses a wide range of esoteric knowledge, including aspects of alchemy, astrology, and theurgy, and has significantly influenced various mystical and occult traditions throughout history. The writings attributed to Hermes Trismegistus, often referred to as the He...",
          "full_content": "Hermeticism, or Hermetism, is a philosophical and religious tradition rooted in the teachings attributed to Hermes Trismegistus, a syncretic figure combining elements of the Greek god Hermes and the Egyptian god Thoth. This system encompasses a wide range of esoteric knowledge, including aspects of alchemy, astrology, and theurgy, and has significantly influenced various mystical and occult traditions throughout history. The writings attributed to Hermes Trismegistus, often referred to as the Hermetica, were produced over a period spanning many centuries (c.300 BCE - 1200 CE) and may be very different in content and scope. One particular form of Hermetic teaching is the religio-philosophical system found in a specific subgroup of Hermetic writings known as the 'religio-philosophical' Hermetica. The most famous of these are the Corpus Hermeticum, a collection of seventeen Greek treatises written between approximately 100 and 300 CE, and the Asclepius, a treatise from the same period, mainly surviving in a Latin translation. This specific historical form of Hermetic philosophy is sometimes more narrowly referred to as Hermetism, to distinguish it from other philosophies inspired by Hermetic writings of different periods and natures. The broader term, Hermeticism, may refer to a wide variety of philosophical systems drawing on Hermetic writings or other subject matter associated with Hermes. Notably, alchemy often went by the name of \"the Hermetic art\" or \"the Hermetic philosop...",
          "sections": [
            {
              "title": "Origins and early development",
              "content": ""
            },
            {
              "title": "Core texts",
              "content": ""
            },
            {
              "title": "Philosophical and theological concepts",
              "content": ""
            },
            {
              "title": "Historical development",
              "content": ""
            },
            {
              "title": "Hermetic practices",
              "content": "\"The three parts of the wisdom of the whole universe\" is a phrase derived from the Emerald Tablet referring to three disciplines of Hermeticism. Hermetic practices are diverse and deeply rooted in the..."
            },
            {
              "title": "Hermeticism and other religions",
              "content": "Hermeticism has influenced and been influenced by major religious traditions, particularly Christianity, Judaism, and Islam. During the Renaissance, Christian scholars like Marsilio Ficino integrated ..."
            }
          ],
          "categories": [
            "Category:All articles with incomplete citations",
            "Category:All articles with unsourced statements",
            "Category:Articles containing Latin-language text",
            "Category:Articles with incomplete citations from August 2024",
            "Category:Articles with short description"
          ],
          "word_count": 5632,
          "summary_word_count": 436,
          "source_type": "wikipedia_api",
          "extraction_success": true
        }
      ],
      "success_count": 3,
      "total_attempted": 3,
      "success_rate": 1.0
    },
    "gnostic_traditions": {
      "tradition_name": "gnostic_traditions",
      "display_name": "Gnostic Traditions",
      "extracted_articles": [
        {
          "title": "Gnosticism",
          "url": "https://en.wikipedia.org/wiki/Gnosticism",
          "summary": "Gnosticism (from Ancient Greek: , romanized: gnstikos, Koine Greek: [nostikos], 'having knowledge') is a collection of religious ideas and systems that coalesced in the late 1st century AD among early Christian sects. These diverse groups emphasized personal spiritual knowledge (gnosis) above the proto-orthodox teachings, traditions, and authority of religious institutions. Generally, in Gnosticism, the Monad is the supreme God who emanates divine beings; one, Sophia, creates the fla...",
          "full_content": "Gnosticism (from Ancient Greek: , romanized: gnstikos, Koine Greek: [nostikos], 'having knowledge') is a collection of religious ideas and systems that coalesced in the late 1st century AD among early Christian sects. These diverse groups emphasized personal spiritual knowledge (gnosis) above the proto-orthodox teachings, traditions, and authority of religious institutions. Generally, in Gnosticism, the Monad is the supreme God who emanates divine beings; one, Sophia, creates the flawed demiurge who makes the material world, trapping souls until they regain divine knowledge. Consequently, Gnostics considered material existence flawed or evil, and held the principal element of salvation to be direct knowledge of the hidden divinity, attained via mystical or esoteric insight. Many Gnostic texts deal not in concepts of sin and repentance, but with illusion and enlightenment. Gnosticism likely originated in the late first and early second centuries around Alexandria, influenced by Jewish-Christian sects, Hellenistic Judaism, Middle Platonism, and diverse religious ideas, with scholarly debate about whether it arose as an intra-Christian movement, from Jewish mystical traditions, or other sources. Gnostic writings flourished among certain Christian groups in the Mediterranean world around the second century, when the Early Church Fathers denounced them as heresy. Efforts to destroy these texts were largely successful, resulting in the survival of very little writing by...",
          "sections": [
            {
              "title": "Etymology",
              "content": "Gnosis is a feminine Greek noun which means \"knowledge\" or \"awareness\". It and the associated verb are often used for personal knowledge, as compared with intellectual knowledge (Greek verb eid..."
            },
            {
              "title": "Origins",
              "content": "The origins of Gnosticism are obscure and still disputed. Alexandria was of central importance for the birth of Gnosticism. Gnosticism is strongly influenced by Middle Platonism and its theory of form..."
            },
            {
              "title": "Characteristics",
              "content": ""
            },
            {
              "title": "Concepts",
              "content": ""
            },
            {
              "title": "Jesus as Gnostic saviour",
              "content": "Jesus is identified by some Gnostics as an embodiment of the supreme being who became incarnate to bring gnsis to the earth, while others adamantly denied that the supreme being came in the flesh, cl..."
            },
            {
              "title": "Development",
              "content": "Three periods can be discerned in the development of Gnosticism: Late-first century and early second century: development of Gnostic ideas, contemporaneous with the writing of the New Testament; mid-..."
            }
          ],
          "categories": [
            "Category:1st-century establishments",
            "Category:All accuracy disputes",
            "Category:All articles covered by WikiProject Wikify",
            "Category:All articles needing references cleanup",
            "Category:All articles with incomplete citations"
          ],
          "word_count": 12039,
          "summary_word_count": 532,
          "source_type": "wikipedia_api",
          "extraction_success": true
        },
        {
          "title": "Nag Hammadi library",
          "url": "https://en.wikipedia.org/wiki/Nag_Hammadi_library",
          "summary": "The Nag Hammadi library (also known as the Chenoboskion Manuscripts and the Gnostic Gospels) is a collection of early Christian and Gnostic texts discovered near the Upper Egyptian town of Nag Hammadi in 1945. Thirteen leather-bound papyrus codices buried in a sealed jar were found by a local farmer named Muhammed al-Samman. The writings in these codices comprise 52 mostly Gnostic treatises, but they also include three works belonging to the Corpus Hermeticum and a partial translation/alteration...",
          "full_content": "The Nag Hammadi library (also known as the Chenoboskion Manuscripts and the Gnostic Gospels) is a collection of early Christian and Gnostic texts discovered near the Upper Egyptian town of Nag Hammadi in 1945. Thirteen leather-bound papyrus codices buried in a sealed jar were found by a local farmer named Muhammed al-Samman. The writings in these codices comprise 52 mostly Gnostic treatises, but they also include three works belonging to the Corpus Hermeticum and a partial translation/alteration of Plato's Republic. In his introduction to The Nag Hammadi Library in English, James Robinson suggests that these codices may have belonged to a nearby Pachomian monastery and were buried after Saint Athanasius condemned the use of non-canonical books in his Festal Letter of 367 A.D. The Pachomian hypothesis has been further expanded by Lundhaug & Jenott (2015, 2018) and further strengthened by Linjamaa (2024). In his 2024 book, Linjamaa argues that the Nag Hammadi library was used by a small intellectual monastic elite at a Pachomian monastery, and that they were used as a smaller part of a much wider Christian library. The contents of the codices were written in the Coptic language. The best-known of these works is probably the Gospel of Thomas, of which the Nag Hammadi codices contain the only complete text. After the discovery, scholars recognized that fragments of these sayings attributed to Jesus appeared in manuscripts discovered at Oxyrhynchus in 1898 (P. Oxy. 1), and matchin...",
          "sections": [
            {
              "title": "Discovery",
              "content": "Scholars first became aware of the Nag Hammadi library in 1946. Making careful inquiries from 1947-1950, Jean Doresse discovered that a local farmer, who was a teenager at the time, dug up the texts f..."
            },
            {
              "title": "Translation",
              "content": "The first edition of a text found at Nag Hammadi was from the Jung Codex, a partial translation of which appeared in Cairo in 1956, and a single extensive facsimile edition was planned. Due to the dif..."
            },
            {
              "title": "List of codices and tractates",
              "content": "The following table contains a list of codices and tractates in the Nag Hammadi library as given by Aleksandr Leonovich Khosroev. Abbreviations are from The Coptic Gnostic Library. The so-called \"Cod..."
            },
            {
              "title": "Dating",
              "content": "Although the manuscripts discovered at Nag Hammadi are generally dated to the 4th century, there is some debate regarding the original composition of the texts. The Gospel of Thomas is held by most ..."
            },
            {
              "title": "See also",
              "content": ""
            },
            {
              "title": "Notes",
              "content": ""
            }
          ],
          "categories": [
            "Category:1945 archaeological discoveries",
            "Category:All articles with unsourced statements",
            "Category:Archaeological corpora",
            "Category:Articles incorporating a citation from the 1913 Catholic Encyclopedia with Wikisource reference",
            "Category:Articles with short description"
          ],
          "word_count": 1827,
          "summary_word_count": 291,
          "source_type": "wikipedia_api",
          "extraction_success": true
        },
        {
          "title": "Sophia (Gnosticism)",
          "url": "https://en.wikipedia.org/wiki/Sophia_(Gnosticism)",
          "summary": "Sophia (Koin Greek: i \"Wisdom\", Coptic: \"the Sophia\") is a figure, along with Knowledge ( gnosis, Coptic: tswn), among many of the early Christian knowledge theologies grouped by the heresiologist Irenaeus as gnostikoi (), \"knowing\". Gnosticism is a 17th-century term expanding the definition of Irenaeus' groups to include other syncretic faiths and the Greco-Roman mysteries. In Gnosticism, Sophia is a feminine figure, analogous to the human soul but also simult...",
          "full_content": "Sophia (Koin Greek: i \"Wisdom\", Coptic: \"the Sophia\") is a figure, along with Knowledge ( gnosis, Coptic: tswn), among many of the early Christian knowledge theologies grouped by the heresiologist Irenaeus as gnostikoi (), \"knowing\". Gnosticism is a 17th-century term expanding the definition of Irenaeus' groups to include other syncretic faiths and the Greco-Roman mysteries. In Gnosticism, Sophia is a feminine figure, analogous to the human soul but also simultaneously one of the feminine aspects of God. Gnostics held that she was the syzygy, or female twin, of Jesus, i.e. the Bride of Christ, and the Holy Spirit of the Trinity. She is occasionally referred to by the term Achamth (, Hebrew: chokmah) and as Prunikos (). In the Nag Hammadi texts, Sophia is the lowest aeon or anthropic emanation of the godhead. Gnostic mythos Many Gnostic systems, particularly those of the Syrian or Egyptian, teach that the universe began with an original, unknowable God referred to as the Parent, Bythos ('Depth') or the Monad. From this primordial source, a series of emanations, or Aeons, emerged. These Aeons, which often appear in male-female pairs called syzygies, collectively form the Pleroma, or 'Fullness' of the divine. This concept emphasizes that the Aeons are not separate from the divine but are symbolic representations of its attributes. The transition from the immaterial to the material, from the noumenal to the sensible, is br...",
          "sections": [
            {
              "title": "Gnostic mythos",
              "content": "Many Gnostic systems, particularly those of the Syrian or Egyptian, teach that the universe began with an original, unknowable God referred to as the Parent, Bythos ('Depth') or the Monad. From this p..."
            },
            {
              "title": "Book of Proverbs",
              "content": "Jewish Alexandrine religious philosophy was much occupied with the concept of the Divine Sophia, as the revelation of God's inward thought, and assigned to her not only the formation and ordering of t..."
            },
            {
              "title": "Descent",
              "content": "In reconciling the doctrine of the pneumatic nature of the Sophia with the dwelling-place assigned her, according to the Proverbs, in the kingdom of the midst, and so outside the upper realm of light,..."
            },
            {
              "title": "Syrian Gnosis",
              "content": "The Sophia mythos has in the various Gnostic systems undergone great variety of treatment. The oldest, the Syrian Gnosis, referred to the Sophia the formation of the lower world and the production of ..."
            },
            {
              "title": "Prunikos",
              "content": "In the Gnostic system described by Irenaeus (I. xxi.; see Ophites) the name Prunikos (Greek: ) several times takes the place of Sophia in the relation of her story. The name Prunikos is also ..."
            },
            {
              "title": "The womb, mtra",
              "content": "Nigh related to this is the notion widely diffused among Gnostic sects of the impure mtra (womb) whence the whole world is supposed to have issued. As according to the Italian Valentinians the Soter ..."
            }
          ],
          "categories": [
            "Category:All articles lacking reliable references",
            "Category:All articles needing additional references",
            "Category:All articles needing expert attention",
            "Category:Articles containing Ancient Greek (to 1453)-language text",
            "Category:Articles containing Coptic-language text"
          ],
          "word_count": 6350,
          "summary_word_count": 136,
          "source_type": "wikipedia_api",
          "extraction_success": true
        }
      ],
      "success_count": 3,
      "total_attempted": 3,
      "success_rate": 1.0
    },
    "tarot_knowledge": {
      "tradition_name": "tarot_knowledge",
      "display_name": "Tarot Knowledge",
      "extracted_articles": [
        {
          "title": "Tarot",
          "url": "https://en.wikipedia.org/wiki/Tarot",
          "summary": "Tarot (, first known as trionfi and later as tarocchi or tarocks) is a set of playing cards used in tarot games and in fortune-telling or divination. From at least the mid-15th century, the tarot was used to play trick-taking card games such as Tarocchini. From their Italian roots, tarot games spread to most of Europe, evolving into new forms including German Grosstarok and modern examples such as French Tarot and Austrian Konigrufen. Tarot is most commonly found in many countries, especial...",
          "full_content": "Tarot (, first known as trionfi and later as tarocchi or tarocks) is a set of playing cards used in tarot games and in fortune-telling or divination. From at least the mid-15th century, the tarot was used to play trick-taking card games such as Tarocchini. From their Italian roots, tarot games spread to most of Europe, evolving into new forms including German Grosstarok and modern examples such as French Tarot and Austrian Konigrufen. Tarot is most commonly found in many countries, especially in English and Spanish speaking countries where tarot games are not as widely played, in the form of specially designed cartomantic decks used primarily for tarot card reading, in which each card corresponds to an assigned archetype or interpretation for divination, fortune-telling or for other non-gaming uses. The emergence of custom decks for use in divination via tarot card reading and cartomancy began after French occultists made elaborate, but unsubstantiated, claims about their history and meaning in the late 18th century. Thus, there are two distinct types of tarot packs in circulation: those used for card games and those used for divination. However, some older patterns, such as the Tarot de Marseille and the Swiss 1JJ Tarot, originally intended for playing card games, are also used for cartomancy. Tarot has four suits that vary by region: French suits are used in western, central and eastern Europe, and Latin suits in southern Europe. Each suit has 14 cards: ten pip cards ...",
          "sections": [
            {
              "title": "Distribution",
              "content": "The use of tarot for trick-taking games was at one time widespread across the whole of Europe except the British Isles, the Iberian Peninsula, and the Balkans. Having fallen into decline by the 20t..."
            },
            {
              "title": "History",
              "content": ""
            },
            {
              "title": "Etymology",
              "content": "The word \"tarot\" and German Tarock derive from the Italian Tarocchi, the origin of which is uncertain, although taroch was used as a synonym for foolishness in the late 15th and early 16th centuries. ..."
            },
            {
              "title": "Playing card decks",
              "content": "The original purpose of tarot cards was to play games. A very cursory explanation of rules for a tarot-like deck is given in a manuscript by Martiano da Tortona before 1425. Vague descriptions of game..."
            },
            {
              "title": "Cartomancy",
              "content": "In countries, such as English speaking countries, where tarot trick taking games are not widely played, only specially designed cartomantic tarot cards, used primarily for novelty and divination, are..."
            },
            {
              "title": "Notes",
              "content": ""
            }
          ],
          "categories": [
            "Category:Articles containing German-language text",
            "Category:Articles with short description",
            "Category:CS1: long volume value",
            "Category:CS1 French-language sources (fr)",
            "Category:CS1 Italian-language sources (it)"
          ],
          "word_count": 3455,
          "summary_word_count": 312,
          "source_type": "wikipedia_api",
          "extraction_success": true
        },
        {
          "title": "Major Arcana",
          "url": "https://en.wikipedia.org/wiki/Major_Arcana",
          "summary": "The Major Arcana are the named cards in a cartomantic tarot pack. There are usually 22 such cards in a standard 78-card pack, typically numbered from 0 to 21 (or 1 to 21, with the Fool being left unnumbered). Although the cards correspond to the trump cards of a pack used for playing tarot card games, the term 'Major Arcana' is rarely used by players and is typically associated exclusively with use for divination by occultists. The Major Arcana are complemented by the Minor Arcana-the 56 unnamed...",
          "full_content": "The Major Arcana are the named cards in a cartomantic tarot pack. There are usually 22 such cards in a standard 78-card pack, typically numbered from 0 to 21 (or 1 to 21, with the Fool being left unnumbered). Although the cards correspond to the trump cards of a pack used for playing tarot card games, the term 'Major Arcana' is rarely used by players and is typically associated exclusively with use for divination by occultists. The Major Arcana are complemented by the Minor Arcana-the 56 unnamed cards of the tarot deck, which more directly correspond to the contemporary standard 52-card deck. History Prior to the 17th century, tarot cards were solely used for playing games and the Fool and 21 trumps had simple allegorical or esoteric meaning, mostly originating in elite ideology in the Italian courts of the 15th century when it was invented. The occult significance began to emerge in the 18th century, when Antoine Court de Gebelin, a Swiss clergyman and Freemason, published two essays on Tarot in his Le Monde Primitif (The Primeval World), a never-completed encyclopedia. In the first essay, \"Du Jeu des Tarots\" (The Game of Tarots), Court de Gebelin assigned Egyptian, kabbalistic, and divine significance to the tarot trumps. Etteilla created a method of divination using tarot; Eliphas Levi worked to break away from the Egyptian nature of the divinatory tarot, bringing it back to the Tarot de Marseille, creating a \"tortuous\" kabbalistic correspondence, and even suggested that ...",
          "sections": [
            {
              "title": "History",
              "content": "Prior to the 17th century, tarot cards were solely used for playing games and the Fool and 21 trumps had simple allegorical or esoteric meaning, mostly originating in elite ideology in the Italian cou..."
            },
            {
              "title": "List of the Major Arcana",
              "content": "Like the early Italian-suited packs on which they were originally based, in a cartomantic pack each Major Arcanum depicts a scene, mostly featuring a person or several people, with many symbolic eleme..."
            },
            {
              "title": "Esotericism",
              "content": "By the 19th century, the Tarot was being claimed as a \"Bible of Bibles\", an esoteric repository of all the significant truths of creation. The trend was started by prominent Freemason and Protestant c..."
            },
            {
              "title": "Fortune telling",
              "content": "Now popularly associated in English-speaking countries with divination, fortune telling, or cartomancy, Tarot was not invented as a mystical or magical tool of divination, but as an instrument for pla..."
            },
            {
              "title": "See also",
              "content": "Playing Cards (Unicode block)"
            },
            {
              "title": "Footnotes",
              "content": ""
            }
          ],
          "categories": [
            "Category:All accuracy disputes",
            "Category:All articles with unsourced statements",
            "Category:Articles with disputed statements from August 2024",
            "Category:Articles with disputed statements from September 2017",
            "Category:Articles with short description"
          ],
          "word_count": 1946,
          "summary_word_count": 102,
          "source_type": "wikipedia_api",
          "extraction_success": true
        },
        {
          "title": "Rider-Waite Tarot",
          "url": "https://en.wikipedia.org/wiki/Rider%E2%80%93Waite_Tarot",
          "summary": "The Rider-Waite Tarot is a widely popular deck for tarot card reading, first published by William Rider & Son in 1909, based on the instructions of academic and mystic A. E. Waite and illustrated by Pamela Colman Smith, both members of the Hermetic Order of the Golden Dawn. Also known as the Waite-Smith, Rider-Waite-Smith, or Rider Tarot, the deck has been published in numerous editions and inspired a wide array of variants and imitations. Estimates suggest over 100 million copies of the deck ci...",
          "full_content": "The Rider-Waite Tarot is a widely popular deck for tarot card reading, first published by William Rider & Son in 1909, based on the instructions of academic and mystic A. E. Waite and illustrated by Pamela Colman Smith, both members of the Hermetic Order of the Golden Dawn. Also known as the Waite-Smith, Rider-Waite-Smith, or Rider Tarot, the deck has been published in numerous editions and inspired a wide array of variants and imitations. Estimates suggest over 100 million copies of the deck circulate across over 20 countries. Overview The Rider-Waite tarot deck has 78 cards: 56 Minor Arcana, and 22 Major Arcana. The Minor Arcana generally correspond to the suits of Spanish or Italian playing cards. The Major Arcana, corresponding to the trump cards of gaming tarot, have unique designs numbered from 0 (The Fool) to 21 (The World). While the images are simple, the details and backgrounds feature abundant symbolism. Some imagery remains similar to that found in earlier decks, but overall the Waite-Smith card designs are substantially different from their predecessors. Christian imagery was removed from some cards, and added to others. For example, the \"Papess\" became the \"High Priestess\" and no longer features a Papal tiara. The \"Lovers\" card, previously depicting a medieval scene of a clothed man and woman receiving a blessing from a noble or cleric was changed to a depiction of the naked Adam and Eve in the Garden of Eden, and the ace of cups featuring a dove carrying Sacra...",
          "sections": [
            {
              "title": "Overview",
              "content": "The Rider-Waite tarot deck has 78 cards: 56 Minor Arcana, and 22 Major Arcana. The Minor Arcana generally correspond to the suits of Spanish or Italian playing cards. The Major Arcana, corresponding t..."
            },
            {
              "title": "Major Arcana",
              "content": "The Major Arcana of the Rider-Waite tarot are illustrated below."
            },
            {
              "title": "Minor Arcana",
              "content": "The Minor Arcana of the Rider-Waite tarot are illustrated below."
            },
            {
              "title": "Publication",
              "content": "The cards were first published in December 1909, by the publisher William Rider & Son of London. The first printing was extremely limited and featured card backs with a roses and lilies pattern. In Ma..."
            },
            {
              "title": "Copyright status",
              "content": "The original version of the Rider-Waite Tarot is in the public domain in all countries that have a copyright term of 70 years or fewer after the death of the last co-author. This includes the United K..."
            },
            {
              "title": "See also",
              "content": "Tarot of Marseilles Thoth Tarot"
            }
          ],
          "categories": [
            "Category:All articles with unsourced statements",
            "Category:Articles with short description",
            "Category:Articles with unsourced statements from January 2025",
            "Category:Commons category link from Wikidata",
            "Category:Divination Tarot decks"
          ],
          "word_count": 817,
          "summary_word_count": 88,
          "source_type": "wikipedia_api",
          "extraction_success": true
        }
      ],
      "success_count": 3,
      "total_attempted": 3,
      "success_rate": 1.0
    },
    "sacred_geometry": {
      "tradition_name": "sacred_geometry",
      "display_name": "Sacred Geometry",
      "extracted_articles": [
        {
          "title": "Sacred geometry",
          "url": "https://en.wikipedia.org/wiki/Sacred_geometry",
          "summary": "Sacred geometry ascribes symbolic and sacred meanings to certain geometric shapes and certain geometric proportions. It is associated with the belief of a divine creator of the universal geometer. The geometry used in the design and construction of religious structures such as churches, temples, mosques, religious monuments, altars, and tabernacles has sometimes been considered sacred. The concept applies also to sacred spaces such as temenoi, sacred groves, village greens, pagodas and holy well...",
          "full_content": "Sacred geometry ascribes symbolic and sacred meanings to certain geometric shapes and certain geometric proportions. It is associated with the belief of a divine creator of the universal geometer. The geometry used in the design and construction of religious structures such as churches, temples, mosques, religious monuments, altars, and tabernacles has sometimes been considered sacred. The concept applies also to sacred spaces such as temenoi, sacred groves, village greens, pagodas and holy wells, Mandala Gardens and the creation of religious and spiritual art. As worldview and cosmology The belief that a god created the universe according to a geometric plan has ancient origins. Plutarch attributed the belief to Plato, writing that \"Plato said God geometrizes continually\" (Convivialium disputationum, liber 8,2). In modern times, the mathematician Carl Friedrich Gauss adapted this quote, saying \"God arithmetizes\". Johannes Kepler (1571-1630) believed in the geometric underpinnings of the cosmos. Harvard mathematician Shing-Tung Yau expressed a belief in the centrality of geometry in 2010: \"Lest one conclude that geometry is little more than a well-calibrated ruler - and this is no knock against the ruler, which happens to be a technology I admire - geometry is one of the main avenues available to us for probing the universe. Physics and cosmology have been, almost by definition, absolutely crucial for making sense of the universe. Geometry's role in this may be less obvious,...",
          "sections": [
            {
              "title": "As worldview and cosmology",
              "content": "The belief that a god created the universe according to a geometric plan has ancient origins. Plutarch attributed the belief to Plato, writing that \"Plato said God geometrizes continually\" (Conviviali..."
            },
            {
              "title": "Natural forms",
              "content": "According to Stephen Skinner, the study of sacred geometry has its roots in the study of nature, and the mathematical principles at work therein. Many forms observed in nature can be related to geomet..."
            },
            {
              "title": "Representations in art and architecture",
              "content": "Geometric ratios, and geometric figures were often employed in the designs of ancient Egyptian, ancient Indian, Greek and Roman architecture. Medieval European cathedrals also incorporated symbolic ge..."
            },
            {
              "title": "Unanchored geometry",
              "content": "Stephen Skinner criticizes the tendency of some writers to place a geometric diagram over virtually any image of a natural object or human created structure, find some lines intersecting the image and..."
            },
            {
              "title": "Notable artists",
              "content": "Hildegard of Bingen Hilma af Klint Olga Frobe-Kapteyn Carl Jung"
            },
            {
              "title": "See also",
              "content": "Circle dance Golden Ratio Ley line Lu Ban and Feng shui Magic circle Harmony of the spheres Numerology Shield of the Trinity Yantra 108 (number)"
            }
          ],
          "categories": [
            "Category:Articles with short description",
            "Category:CS1: abbreviated year range",
            "Category:Commons category link is on Wikidata",
            "Category:Sacred geometry",
            "Category:Short description matches Wikidata"
          ],
          "word_count": 1951,
          "summary_word_count": 83,
          "source_type": "wikipedia_api",
          "extraction_success": true
        },
        {
          "title": "Golden ratio",
          "url": "https://en.wikipedia.org/wiki/Golden_ratio",
          "summary": "In mathematics, two quantities are in the golden ratio if their ratio is the same as the ratio of their sum to the larger of the two quantities. Expressed algebraically, for quantities a {\\displaystyle a} and b {\\displaystyle b} with a > b > 0 {\\displaystyle a>b>0} , a {\\displaystyle a} ...",
          "full_content": "In mathematics, two quantities are in the golden ratio if their ratio is the same as the ratio of their sum to the larger of the two quantities. Expressed algebraically, for quantities a {\\displaystyle a} and b {\\displaystyle b} with a > b > 0 {\\displaystyle a>b>0} , a {\\displaystyle a} is in a golden ratio to b {\\displaystyle b} if a + b a = a b = , {\\displaystyle { rac {a+b}{a}}={ rac {a}{b}}=\\varphi ,} where the Greek letter phi ( {\\displaystyle \\varphi } or {\\displaystyle \\phi } ) denotes the golden ratio. The constant {\\displaystyle \\varphi } satisfies the quadratic equation 2 = + 1 {\\displaystyle extstyle \\varphi ^{2}=\\varphi +1} and is an irrational ...",
          "sections": [
            {
              "title": "Calculation",
              "content": "Two quantities a {\\displaystyle a} and b {\\displaystyle b} are in the golden ratio ..."
            },
            {
              "title": "History",
              "content": "According to Mario Livio, Some of the greatest mathematical minds of all ages, from Pythagoras and Euclid in ancient Greece, through the medieval Italian mathematician Leonardo of Pisa and the Renais..."
            },
            {
              "title": "Mathematics",
              "content": ""
            },
            {
              "title": "Applications and observations",
              "content": ""
            },
            {
              "title": "Disputed observations",
              "content": "Examples of disputed observations of the golden ratio include the following: Specific proportions in the bodies of vertebrates (including humans) are often claimed to be in the golden ratio; for exam..."
            },
            {
              "title": "See also",
              "content": "List of works designed with the golden ratio Metallic mean Plastic ratio Sacred geometry Supergolden ratio Silver ratio"
            }
          ],
          "categories": [
            "Category:Articles with short description",
            "Category:CS1: long volume value",
            "Category:CS1 French-language sources (fr)",
            "Category:CS1 German-language sources (de)",
            "Category:CS1 Latin-language sources (la)"
          ],
          "word_count": 9818,
          "summary_word_count": 315,
          "source_type": "wikipedia_api",
          "extraction_success": true
        },
        {
          "title": "Platonic solid",
          "url": "https://en.wikipedia.org/wiki/Platonic_solid",
          "summary": "In geometry, a Platonic solid is a convex, regular polyhedron in three-dimensional Euclidean space. Being a regular polyhedron means that the faces are congruent (identical in shape and size) regular polygons (all angles congruent and all edges congruent), and the same number of faces meet at each vertex. There are only five such polyhedra: Geometers have studied the Platonic solids for thousands of years. They are named for the ancient Greek philosopher Plato, who hypothesized in one of his di...",
          "full_content": "In geometry, a Platonic solid is a convex, regular polyhedron in three-dimensional Euclidean space. Being a regular polyhedron means that the faces are congruent (identical in shape and size) regular polygons (all angles congruent and all edges congruent), and the same number of faces meet at each vertex. There are only five such polyhedra: Geometers have studied the Platonic solids for thousands of years. They are named for the ancient Greek philosopher Plato, who hypothesized in one of his dialogues, the Timaeus, that the classical elements were made of these regular solids. History The Platonic solids have been known since antiquity. It has been suggested that certain carved stone balls created by the late Neolithic people of Scotland represent these shapes; however, these balls have rounded knobs rather than being polyhedral, the numbers of knobs frequently differed from the numbers of vertices of the Platonic solids, there is no ball whose knobs match the 20 vertices of the dodecahedron, and the arrangement of the knobs was not always symmetrical. The ancient Greeks studied the Platonic solids extensively. Some sources (such as Proclus) credit Pythagoras with their discovery. Other evidence suggests that he may have only been familiar with the tetrahedron, cube, and dodecahedron and that the discovery of the octahedron and icosahedron belong to Theaetetus, a contemporary of Plato. In any case, Theaetetus gave a mathematical description of all five and may have been res...",
          "sections": [
            {
              "title": "History",
              "content": "The Platonic solids have been known since antiquity. It has been suggested that certain carved stone balls created by the late Neolithic people of Scotland represent these shapes; however, these balls..."
            },
            {
              "title": "Cartesian coordinates",
              "content": "For Platonic solids centered at the origin, simple Cartesian coordinates of the vertices are given below. The Greek letter {\\displaystyle \\varphi } is use..."
            },
            {
              "title": "Combinatorial properties",
              "content": "A convex polyhedron is a Platonic solid if and only if all three of the following requirements are met. All of its faces are congruent convex regular polygons. None of its faces intersect except at t..."
            },
            {
              "title": "Classification",
              "content": "The classical result is that only five convex regular polyhedra exist. Two common arguments below demonstrate no more than five Platonic solids can exist, but positively demonstrating the existence of..."
            },
            {
              "title": "Geometric properties",
              "content": ""
            },
            {
              "title": "Symmetry",
              "content": ""
            }
          ],
          "categories": [
            "Category:All articles needing additional references",
            "Category:Articles needing additional references from April 2025",
            "Category:Articles with short description",
            "Category:CS1 German-language sources (de)",
            "Category:CS1 errors: ISBN date"
          ],
          "word_count": 5005,
          "summary_word_count": 92,
          "source_type": "wikipedia_api",
          "extraction_success": true
        }
      ],
      "success_count": 3,
      "total_attempted": 3,
      "success_rate": 1.0
    },
    "chaos_magic": {
      "tradition_name": "chaos_magic",
      "display_name": "Chaos Magic",
      "extracted_articles": [
        {
          "title": "Chaos magic",
          "url": "https://en.wikipedia.org/wiki/Chaos_magic",
          "summary": "Chaos magic, also spelled chaos magick, is a modern tradition of magic. Emerging in England in the 1970s as part of the wider neo-pagan and esoteric subculture, it drew heavily from the occult beliefs of artist Austin Osman Spare, expressed several decades earlier. It has been characterised as an invented religion, with some commentators drawing similarities between the movement and Discordianism. Magical organizations within this tradition include the Illuminates of Thanateros and Thee Temple o...",
          "full_content": "Chaos magic, also spelled chaos magick, is a modern tradition of magic. Emerging in England in the 1970s as part of the wider neo-pagan and esoteric subculture, it drew heavily from the occult beliefs of artist Austin Osman Spare, expressed several decades earlier. It has been characterised as an invented religion, with some commentators drawing similarities between the movement and Discordianism. Magical organizations within this tradition include the Illuminates of Thanateros and Thee Temple ov Psychick Youth. The founding figures of chaos magic believed that other occult traditions had become too religious in character. They attempted to strip away the symbolic, ritualistic, theological, or otherwise ornamental aspects of these occult traditions, to leave behind a set of basic techniques that they believed to be the basis of magic. Chaos magic teaches that the essence of magic is that perceptions are conditioned by beliefs, and that the world as it is normally perceived can be changed by deliberately changing those beliefs. Chaos magicians subsequently treat belief as a tool, often creating their own idiosyncratic magical systems and blending such different things as \"practical magic, quantum physics, chaos theory, and anarchism.\" Scholar Hugh Urban has described chaos magic as a union of traditional occult techniques and applied postmodernism - particularly a postmodernist skepticism concerning the existence or knowability of objective truth, positing that chaos magic re...",
          "sections": [
            {
              "title": "History",
              "content": ""
            },
            {
              "title": "Beliefs, core concepts, and practices",
              "content": ""
            },
            {
              "title": "References",
              "content": ""
            }
          ],
          "categories": [
            "Category:All Wikipedia neutral point of view disputes",
            "Category:All articles with unsourced statements",
            "Category:Articles with short description",
            "Category:Articles with unsourced statements from July 2022",
            "Category:Belief"
          ],
          "word_count": 1931,
          "summary_word_count": 248,
          "source_type": "wikipedia_api",
          "extraction_success": true
        },
        {
          "title": "Paradigm shift",
          "url": "https://en.wikipedia.org/wiki/Paradigm_shift",
          "summary": "A paradigm shift is a fundamental change in the basic concepts and experimental practices of a scientific discipline. It is a concept in the philosophy of science that was introduced and brought into the common lexicon by the American physicist and philosopher Thomas Kuhn. Even though Kuhn restricted the use of the term to the natural sciences, the concept of a paradigm shift has also been used in numerous non-scientific contexts to describe a profound change in a fundamental model or perception...",
          "full_content": "A paradigm shift is a fundamental change in the basic concepts and experimental practices of a scientific discipline. It is a concept in the philosophy of science that was introduced and brought into the common lexicon by the American physicist and philosopher Thomas Kuhn. Even though Kuhn restricted the use of the term to the natural sciences, the concept of a paradigm shift has also been used in numerous non-scientific contexts to describe a profound change in a fundamental model or perception of events. Kuhn presented his notion of a paradigm shift in his influential book The Structure of Scientific Revolutions (1962). Kuhn contrasts paradigm shifts, which characterize a Scientific Revolution, to the activity of normal science, which he describes as scientific work done within a prevailing framework or paradigm. Paradigm shifts arise when the dominant paradigm under which normal science operates is rendered incompatible with new phenomena, facilitating the adoption of a new theory or paradigm. As one commentator summarizes: Kuhn acknowledges having used the term \"paradigm\" in two different meanings. In the first one, \"paradigm\" designates what the members of a certain scientific community have in common, that is to say, the whole of techniques, patents and values shared by the members of the community. In the second sense, the paradigm is a single element of a whole, say for instance Newton's Principia, which, acting as a common model or an example... stands for the expli...",
          "sections": [
            {
              "title": "History",
              "content": "The nature of scientific revolutions has been studied by modern philosophy since Immanuel Kant used the phrase in the preface to the second edition of his Critique of Pure Reason (1787). Kant used the..."
            },
            {
              "title": "Features",
              "content": ""
            },
            {
              "title": "Examples",
              "content": ""
            },
            {
              "title": "Other uses",
              "content": "The term \"paradigm shift\" has found uses in other contexts, representing the notion of a major change in a certain thought pattern-a radical change in personal beliefs, complex systems or organization..."
            },
            {
              "title": "Criticism",
              "content": "In a 2015 retrospective on Kuhn, the philosopher Martin Cohen describes the notion of the paradigm shift as a kind of intellectual virus - spreading from hard science to social science and on to the a..."
            },
            {
              "title": "See also",
              "content": ""
            }
          ],
          "categories": [
            "Category:All articles with unsourced statements",
            "Category:Articles containing German-language text",
            "Category:Articles with Internet Encyclopedia of Philosophy links",
            "Category:Articles with short description",
            "Category:Articles with specifically marked weasel-worded phrases from December 2020"
          ],
          "word_count": 2909,
          "summary_word_count": 355,
          "source_type": "wikipedia_api",
          "extraction_success": true
        },
        {
          "title": "Austin Osman Spare",
          "url": "https://en.wikipedia.org/wiki/Austin_Osman_Spare",
          "summary": "Austin Osman Spare (30 December 1886 - 15 May 1956) was an English artist and occultist who worked as both a draughtsman and a painter. Influenced by symbolism and Art Nouveau, his art was known for its clear use of line, and its depiction of monstrous and sexual imagery. In an occult capacity, he developed magical techniques including automatic writing, automatic drawing and sigilization based on his theories of the relationship between the conscious and unconscious self. Born into a working-cl...",
          "full_content": "Austin Osman Spare (30 December 1886 - 15 May 1956) was an English artist and occultist who worked as both a draughtsman and a painter. Influenced by symbolism and Art Nouveau, his art was known for its clear use of line, and its depiction of monstrous and sexual imagery. In an occult capacity, he developed magical techniques including automatic writing, automatic drawing and sigilization based on his theories of the relationship between the conscious and unconscious self. Born into a working-class family in Snow Hill in London, Spare grew up in Smithfield and then Kennington, taking an early interest in art. Gaining a scholarship to study at the Royal College of Art in South Kensington, he trained as a draughtsman, while also taking a personal interest in theosophy and Western esotericism, becoming briefly involved with Aleister Crowley and his AA. Developing his own personal occult philosophy, he wrote a series of occult grimoires, namely Earth Inferno (1905), The Book of Pleasure (1913) and The Focus of Life (1921). Alongside a string of personal exhibitions, he also achieved much press attention for being the youngest entrant at the 1904 Royal Academy summer exhibition. After publishing a short-lived art magazine, Form, during the First World War he was conscripted into the armed forces and worked as an official war artist. Spare attempted to revive Form after the war before shifting his efforts to The Golden Hind, in partnership with Clifford Bax. Moving to various wor...",
          "sections": [
            {
              "title": "Biography",
              "content": ""
            },
            {
              "title": "As artist",
              "content": "Spare's work is remarkable for its variety, including paintings, a vast number of drawings, work with pastel, a few etchings, published books combining text with imagery, and even bizarre bookplates. ..."
            },
            {
              "title": "Zos Kia Cultus",
              "content": "From his early years, Spare developed his own magico-religious philosophy which has come to be known as the Zos Kia Cultus (also Zos-Kia Cultus), a term coined by the occultist Kenneth Grant. Raised i..."
            },
            {
              "title": "Personal life",
              "content": "Spare was often described as kind and down-to-earth by his friends. A lifelong animal lover, he took care of many animals that he found near his home and was a member of the Royal Society for the Prev..."
            },
            {
              "title": "Death",
              "content": "In May 1956, Spare's appendix burst and he was admitted to South Western Hospital in London's Stockwell district, where doctors noted that he had also been suffering from anaemia, bronchitis, gall sto..."
            },
            {
              "title": "Legacy and influence",
              "content": ""
            }
          ],
          "categories": [
            "Category:1886 births",
            "Category:1956 deaths",
            "Category:20th-century British war artists",
            "Category:20th-century English male artists",
            "Category:20th-century English painters"
          ],
          "word_count": 6269,
          "summary_word_count": 396,
          "source_type": "wikipedia_api",
          "extraction_success": true
        }
      ],
      "success_count": 3,
      "total_attempted": 3,
      "success_rate": 1.0
    },
    "norse_traditions": {
      "tradition_name": "norse_traditions",
      "display_name": "Norse Traditions",
      "extracted_articles": [
        {
          "title": "Norse mythology",
          "url": "https://en.wikipedia.org/wiki/Norse_mythology",
          "summary": "Norse, Nordic, or Scandinavian mythology, is the body of myths belonging to the North Germanic peoples, stemming from Old Norse religion and continuing after the Christianization of Scandinavia as the Nordic folklore of the modern period. The northernmost extension of Germanic mythology and stemming from Proto-Germanic folklore, Norse mythology consists of tales of various deities, beings, and heroes derived from numerous sources from both before and after the pagan period, including medieval ma...",
          "full_content": "Norse, Nordic, or Scandinavian mythology, is the body of myths belonging to the North Germanic peoples, stemming from Old Norse religion and continuing after the Christianization of Scandinavia as the Nordic folklore of the modern period. The northernmost extension of Germanic mythology and stemming from Proto-Germanic folklore, Norse mythology consists of tales of various deities, beings, and heroes derived from numerous sources from both before and after the pagan period, including medieval manuscripts, archaeological representations, and folk tradition. The source texts mention numerous gods such as the thunder-god Thor, the raven-flanked god Odin, the goddess Freyja, and numerous other deities. Most of the surviving mythology centers on the plights of the gods and their interaction with several other beings, such as humanity and the jotnar, beings who may be friends, lovers, foes, or family members of the gods. The cosmos in Norse mythology consists of Nine Worlds that flank a central sacred tree, Yggdrasil. Units of time and elements of the cosmology are personified as deities or beings. Various forms of a creation myth are recounted, where the world is created from the flesh of the primordial being Ymir, and the first two humans are Ask and Embla. These worlds are foretold to be reborn after the events of Ragnarok when an immense battle occurs between the gods and their enemies, and the world is enveloped in flames, only to be reborn anew. There the surviving gods will...",
          "sections": [
            {
              "title": "Terminology",
              "content": "The historical religion of the Norse people is commonly referred to as Norse mythology. Other terms are Scandinavian mythology, North Germanic mythology or Nordic mythology."
            },
            {
              "title": "Sources",
              "content": "Norse mythology is primarily attested in dialects of Old Norse, a North Germanic language spoken by the Scandinavian people during the European Middle Ages and the ancestor of modern Scandinavian lang..."
            },
            {
              "title": "Mythology",
              "content": ""
            },
            {
              "title": "See also",
              "content": "Alliterative verse Family tree of the Norse gods List of Germanic deities List of valkyrie names in Norse mythology Greek mythology Roman mythology The horse in Nordic mythology"
            },
            {
              "title": "References",
              "content": ""
            },
            {
              "title": "Further reading",
              "content": ""
            }
          ],
          "categories": [
            "Category:Articles containing Latin-language text",
            "Category:Articles with short description",
            "Category:Commons category link is on Wikidata",
            "Category:Norse mythology",
            "Category:Short description is different from Wikidata"
          ],
          "word_count": 2811,
          "summary_word_count": 344,
          "source_type": "wikipedia_api",
          "extraction_success": true
        },
        {
          "title": "Runes",
          "url": "https://en.wikipedia.org/wiki/Runes",
          "summary": "Runes are the letters in a set of related alphabets, known as runic rows, runic alphabets or futharks (also, see futhark vs runic alphabet), native to the Germanic peoples. Runes were primarily used to represent a sound value (a phoneme) but they were also used to represent the concepts after which they are named (ideographic runes). Runology is the academic study of the runic alphabets, runic inscriptions, runestones, and their history. Runology forms a specialised branch of Germanic philology....",
          "full_content": "Runes are the letters in a set of related alphabets, known as runic rows, runic alphabets or futharks (also, see futhark vs runic alphabet), native to the Germanic peoples. Runes were primarily used to represent a sound value (a phoneme) but they were also used to represent the concepts after which they are named (ideographic runes). Runology is the academic study of the runic alphabets, runic inscriptions, runestones, and their history. Runology forms a specialised branch of Germanic philology. The earliest secure runic inscriptions date from at latest AD 150, with a possible earlier inscription dating to AD 50 and Tacitus's possible description of rune use from around AD 98. The Svingerud Runestone dates from between AD 1 and 250. Runes were generally replaced by the Latin alphabet as the cultures that had used runes underwent Christianisation, by approximately AD 700 in central Europe and 1100 in northern Europe. However, the use of runes persisted for specialized purposes beyond this period. Up until the early 20th century, runes were still used in rural Sweden for decorative purposes in Dalarna and on runic calendars. The three best-known runic alphabets are the Elder Futhark (c. AD 150-800), the Anglo-Saxon Futhorc (400-1100), and the Younger Futhark (800-1100). The Younger Futhark is divided further into the long-branch runes (also called Danish, although they were also used in Norway, Sweden, and Frisia); short-branch, or Rok, runes (also called Swedish-Norwegian, alt...",
          "sections": [
            {
              "title": "Name",
              "content": ""
            },
            {
              "title": "History and use",
              "content": "The runes were in use among the Germanic peoples from the 1st or 2nd century AD. This period corresponds to the late Common Germanic stage linguistically, with a continuum of dialects not yet clearly ..."
            },
            {
              "title": "Futharks",
              "content": "Futhark is a collective term in runology used to describe all runic rows which follows the Germanic alphabetical order of F, U, , A, R, K.. etc (compare Runic alphabets). In English, it is also com..."
            },
            {
              "title": "Runic alphabets",
              "content": "The term Runic alphabet is sometimes used in runology to describe runic rows following the Latin alphabetical order of A, B, C, D, etc. (compare Futhark)."
            },
            {
              "title": "Differences from Roman script",
              "content": "While Roman script would ultimately replace runes in most contexts, it differed significantly from runic script. For example, on the differences between the use of Anglo-Saxon runes and the Latin scri..."
            },
            {
              "title": "Ideographic runes",
              "content": "In addition to their historic use as letters, runes were also used to represent their names as ideographs. Such instances are sometimes referred to by way of the modern German loanword Begriffsrunen, ..."
            }
          ],
          "categories": [
            "Category:All articles needing additional references",
            "Category:All articles with unsourced statements",
            "Category:Alphabets",
            "Category:Articles containing Ancient Greek (to 1453)-language text",
            "Category:Articles containing Danish-language text"
          ],
          "word_count": 5634,
          "summary_word_count": 383,
          "source_type": "wikipedia_api",
          "extraction_success": true
        },
        {
          "title": "Odin",
          "url": "https://en.wikipedia.org/wiki/Odin",
          "summary": "Odin (; from Old Norse: Oinn) is a widely revered god in Norse mythology and Germanic paganism. Most surviving information on Odin comes from Norse mythology, but he figures prominently in the recorded history of Northern Europe. This includes the Roman Empire's partial occupation of Germania (c.2 BC), the Migration Period (4th-6th centuries AD) and the Viking Age (8th-11th centuries AD). Consequently, Odin has hundreds of names and titles. Several of these stem from the reconstructed Proto-Ge...",
          "full_content": "Odin (; from Old Norse: Oinn) is a widely revered god in Norse mythology and Germanic paganism. Most surviving information on Odin comes from Norse mythology, but he figures prominently in the recorded history of Northern Europe. This includes the Roman Empire's partial occupation of Germania (c.2 BC), the Migration Period (4th-6th centuries AD) and the Viking Age (8th-11th centuries AD). Consequently, Odin has hundreds of names and titles. Several of these stem from the reconstructed Proto-Germanic theonym Wanaz, meaning \"lord of frenzy\" or \"leader of the possessed\", which may relate to the god's strong association with poetry. Most mythological stories about Odin survive from the 13th-century Prose Edda and an earlier collection of Old Norse poems, the Poetic Edda, along with other Old Norse items like Ynglinga saga. The Prose Edda and other sources depict Odin as the head of the pantheon, sometimes called the sir, and bearing a spear and a ring. Wider sources depict Odin as the son of Bestla and Borr; brother to Vili and Ve; and husband to the goddess Frigg, with whom he fathered Baldr. Odin has many other sons, including Thor, whom he sired with the earth-goddess Jor. He is sometimes accompanied by animal familiars, such as the ravens Huginn and Muninn and the wolves Geri and Freki. The Prose Edda describes Odin and his brothers' creation of the world through slaying the primordial being Ymir, and his giving of life to the first humans. Odin is often referred to as...",
          "sections": [
            {
              "title": "Name",
              "content": ""
            },
            {
              "title": "Attestations",
              "content": ""
            },
            {
              "title": "Archaeological record",
              "content": "References to or depictions of Odin appear on numerous objects. Migration Period (5th and 6th century CE) gold bracteates (types A, B, and C) feature a depiction of a human figure above a horse, holdi..."
            },
            {
              "title": "Origin and theories",
              "content": "Beginning with Henry Petersen's doctoral dissertation in 1876, which proposed that Thor was the indigenous god of Scandinavian farmers and Odin a later god proper to chieftains and poets, many scholar..."
            },
            {
              "title": "Modern influence",
              "content": "The god Odin has been a source of inspiration for artists working in fine art, literature, and music. Fine art depictions of Odin in the modern period include the pen and ink drawing Odin byggande Sig..."
            },
            {
              "title": "Explanatory notes",
              "content": ""
            }
          ],
          "categories": [
            "Category:All articles with incomplete citations",
            "Category:Articles containing Bavarian-language text",
            "Category:Articles containing Danish-language text",
            "Category:Articles containing Dutch-language text",
            "Category:Articles containing Faroese-language text"
          ],
          "word_count": 7224,
          "summary_word_count": 507,
          "source_type": "wikipedia_api",
          "extraction_success": true
        }
      ],
      "success_count": 3,
      "total_attempted": 3,
      "success_rate": 1.0
    },
    "sufi_mysticism": {
      "tradition_name": "sufi_mysticism",
      "display_name": "Sufi Mysticism",
      "extracted_articles": [
        {
          "title": "Sufism",
          "url": "https://en.wikipedia.org/wiki/Sufism",
          "summary": "Sufism (Arabic: , romanized: a-fiyya or Arabic: , romanized: at-Taawwuf) is a mystic body of religious practice found within Islam which is characterized by a focus on Islamic purification, spirituality, ritualism, and asceticism. Practitioners of Sufism are referred to as \"Sufis\" (from , fy), and historically typically belonged to \"orders\" known as tariqa (pl. turuq) - congregations formed around a grand wali (saint) who would be the last in a chain of successive t...",
          "full_content": "Sufism (Arabic: , romanized: a-fiyya or Arabic: , romanized: at-Taawwuf) is a mystic body of religious practice found within Islam which is characterized by a focus on Islamic purification, spirituality, ritualism, and asceticism. Practitioners of Sufism are referred to as \"Sufis\" (from , fy), and historically typically belonged to \"orders\" known as tariqa (pl. turuq) - congregations formed around a grand wali (saint) who would be the last in a chain of successive teachers linking back to Muhammad, with the goal of undergoing tazkiya (self purification) and the hope of reaching the spiritual station of ihsan. The ultimate aim of Sufis is to seek the pleasure of God by endeavoring to return to their original state of purity and natural disposition, known as fitra. Sufism emerged early on in Islamic history, partly as a reaction against the expansion of the early Umayyad Caliphate (661-750) and mainly under the tutelage of Hasan al-Basri. Although Sufis were opposed to dry legalism, they strictly observed Islamic law and belonged to various schools of Islamic jurisprudence and theology. Although the overwhelming majority of Sufis, both pre-modern and modern, remain adherents of Sunni Islam, certain strands of Sufi thought transferred over to the ambits of Shia Islam during the late medieval period. This particularly happened after the Safavid conversion of Iran under the concept of irfan. Important focuses of Sufi worship include dhikr, the practic...",
          "sections": [
            {
              "title": "Definitions",
              "content": "The Arabic word tasawwuf (lit.''Sufism''), generally translated as Sufism, is commonly defined by Western authors as Islamic mysticism. The Arabic term Sufi has been used in Islamic literature with a..."
            },
            {
              "title": "Etymology",
              "content": "The original meaning of f seems to have been \"one who wears wool (f)\", and the Encyclopaedia of Islam calls other etymological hypotheses \"untenable\". Woolen clothes were traditionally associated..."
            },
            {
              "title": "History",
              "content": ""
            },
            {
              "title": "Aims and objectives",
              "content": "While all Muslims believe that they are on the pathway to Allah and hope to become close to God in Paradise-after death and after the Last Judgment-Sufis also believe that it is possible to draw close..."
            },
            {
              "title": "Devotional practices",
              "content": "The devotional practices of Sufis vary widely. Prerequisites to practice include rigorous adherence to Islamic norms (ritual prayer in its five prescribed times each day, the fast of Ramadan, and so f..."
            },
            {
              "title": "Saints",
              "content": "Wal (Arabic: , plural awliy ) is an Arabic word whose literal meanings include \"custodian\", \"protector\", \"helper\", and \"friend\". In the vernacular, it is most commonly used by Muslims to ..."
            }
          ],
          "categories": [
            "Category:All articles lacking reliable references",
            "Category:All articles that may contain original research",
            "Category:All articles with incomplete citations",
            "Category:All articles with unsourced statements",
            "Category:All pages needing factual verification"
          ],
          "word_count": 11519,
          "summary_word_count": 299,
          "source_type": "wikipedia_api",
          "extraction_success": true
        },
        {
          "title": "Mevlevi Order",
          "url": "https://en.wikipedia.org/wiki/Mevlevi_Order",
          "summary": "The Mevlevi Order or Mawlawiyya (Turkish: Mevlevilik; Persian: ) is a Sufi order that originated in Konya, Turkey (formerly capital of the Sultanate of Rum) and which was founded by the followers of Jalaluddin Muhammad Balkhi Rumi, a 13th-century Persian poet, Sufi mystic, and theologian. The Mevlevis are also known as the \"whirling dervishes\" due to their famous practice of whirling while performing dhikr (remembrance of God). Dervish is a common term for an initiate of the Sufi pat...",
          "full_content": "The Mevlevi Order or Mawlawiyya (Turkish: Mevlevilik; Persian: ) is a Sufi order that originated in Konya, Turkey (formerly capital of the Sultanate of Rum) and which was founded by the followers of Jalaluddin Muhammad Balkhi Rumi, a 13th-century Persian poet, Sufi mystic, and theologian. The Mevlevis are also known as the \"whirling dervishes\" due to their famous practice of whirling while performing dhikr (remembrance of God). Dervish is a common term for an initiate of the Sufi path; whirling is part of the formal sema ceremony and the participants are properly known as semazens. In 2005, UNESCO confirmed \"The Mevlevi Sema Ceremony\" as amongst the Masterpieces of the Oral and Intangible Heritage of Humanity. Principles and practices Approximately 750 years old, the Mevlevi Order was once a living tradition based on the teachings of Rumi, also known as Mevlevi or Mevlana, who is perhaps one of the most celebrated poets in Turkey. He is also venerated as a mystic within Islam. Rumi's friend and mentor, Shams of Tabriz, is also revered within the order and within Sufism. The Mevlevis insist that love is central to Islam. Mevlevi shaikh efik Can writes, \"Rumi tells us to take the love of God to the forefront, to abstain from being attached to the letter of the law rather than the spirit of it, to find the essence of the faith, and to raise our faith from the level of imitation to the level of realization.\" In addition to obligatory Islamic worship, some of the mai...",
          "sections": [
            {
              "title": "Principles and practices",
              "content": "Approximately 750 years old, the Mevlevi Order was once a living tradition based on the teachings of Rumi, also known as Mevlevi or Mevlana, who is perhaps one of the most celebrated poets in Turkey. ..."
            },
            {
              "title": "Sema",
              "content": "The Sema with the greatest significance to the Mevlevi order is the annual celebration of Mevlana's \"marriage to god\" (death), also called Seb-i Arus, meaning Nuptial Night or Night of Union. It is ob..."
            },
            {
              "title": "History",
              "content": ""
            },
            {
              "title": "Relationship with the Ottoman Empire",
              "content": ""
            },
            {
              "title": "Notes",
              "content": ""
            },
            {
              "title": "External links",
              "content": "Mevlevi Order of America Video of Ensemble Al-Kindi & The Whirling Dervishes of Damascus Pictures of Mevlevi museum in Istanbul Pictures of Mevlevi museum in Konya Mevleviname: Mevlevism in Western T..."
            }
          ],
          "categories": [
            "Category:Articles containing Arabic-language text",
            "Category:Articles containing Persian-language text",
            "Category:Articles containing Turkish-language text",
            "Category:Articles with short description",
            "Category:Commons category link is on Wikidata"
          ],
          "word_count": 3244,
          "summary_word_count": 116,
          "source_type": "wikipedia_api",
          "extraction_success": true
        },
        {
          "title": "Rumi",
          "url": "https://en.wikipedia.org/wiki/Rumi",
          "summary": "Jall al-Dn Muammad Rm (Persian: ), or simply Rumi (30 September 1207 - 17 December 1273), was a 13th-century poet, Hanafi faqih (jurist), Maturidi theologian (mutakallim), and Sufi mystic born during the Khwarazmian Empire. Rumi's works were written mostly in Persian, but occasionally he also used Turkish, Arabic and Greek in his verse. His Masnavi (Mathnawi), composed in Konya, is considered one of the greatest poems of the Persian language. Rumi's influence has transc...",
          "full_content": "Jall al-Dn Muammad Rm (Persian: ), or simply Rumi (30 September 1207 - 17 December 1273), was a 13th-century poet, Hanafi faqih (jurist), Maturidi theologian (mutakallim), and Sufi mystic born during the Khwarazmian Empire. Rumi's works were written mostly in Persian, but occasionally he also used Turkish, Arabic and Greek in his verse. His Masnavi (Mathnawi), composed in Konya, is considered one of the greatest poems of the Persian language. Rumi's influence has transcended national borders and ethnic divisions: Iranians, Afghans, Tajiks, Turks, Kurds, Greeks, Central Asian Muslims, as well as Muslims of the Indian subcontinent have greatly appreciated his spiritual legacy for the past seven centuries. His poetry influenced not only Persian literature, but also the literary traditions of the Ottoman Turkish, Chagatai, Pashto, Kurdish, Urdu, and Bengali languages. Rumi's works are widely read today in their original language across Greater Iran and the Persian-speaking world. His poems have subsequently been translated into many of the world's languages and transposed into various formats. Rumi has been described as the \"most popular poet\", is very popular in Turkey, Azerbaijan and South Asia, and has become the \"best selling poet\" in the United States. Name He is most commonly called Rumi in English. His full name is given by his contemporary Faridun bin Ahmad Sipahsalar as Muhammad bin Muhammad bin al-Husayn al-Khatibi al-Balkhi al-Bakri (Arabic:...",
          "sections": [
            {
              "title": "Name",
              "content": "He is most commonly called Rumi in English. His full name is given by his contemporary Faridun bin Ahmad Sipahsalar as Muhammad bin Muhammad bin al-Husayn al-Khatibi al-Balkhi al-Bakri (Arabic: ..."
            },
            {
              "title": "Life",
              "content": ""
            },
            {
              "title": "Teachings",
              "content": "Like other mystic and Sufi poets of Persian literature, Rumi's poetry speaks of love which infuses the world. Rumi's teachings also express the tenets summarized in the Quranic verse which Shams-e Tab..."
            },
            {
              "title": "Major works",
              "content": "Rumi's poetry is often divided into various categories: the quatrains (rubayt) and odes (ghazal) of the Divan, the six books of the Masnavi. The prose works are divided into The Discourses, The Lette..."
            },
            {
              "title": "Religious outlook",
              "content": "Despite references to other religions, Rumi clearly holds the superiority of Islam. As Muslim, Rumi praises the Quran, not only as sacred book of Muslims, but also as tool to distinguish truth from fa..."
            },
            {
              "title": "Legacy",
              "content": ""
            }
          ],
          "categories": [
            "Category:1207 births",
            "Category:1273 deaths",
            "Category:13th-century Iranian philosophers",
            "Category:13th-century Islamic religious leaders",
            "Category:13th-century Muslim theologians"
          ],
          "word_count": 6190,
          "summary_word_count": 195,
          "source_type": "wikipedia_api",
          "extraction_success": true
        }
      ],
      "success_count": 3,
      "total_attempted": 3,
      "success_rate": 1.0
    },
    "celtic_druidic": {
      "tradition_name": "celtic_druidic",
      "display_name": "Celtic Druidic",
      "extracted_articles": [
        {
          "title": "Celtic mythology",
          "url": "https://en.wikipedia.org/wiki/Celtic_mythology",
          "summary": "Celtic mythology is the body of myths belonging to the Celtic peoples. Like other Iron Age Europeans, Celtic peoples followed a polytheistic religion, having many gods and goddesses. The mythologies of continental Celtic peoples, such as the Gauls and Celtiberians, did not survive their conquest by the Roman Empire, the loss of their Celtic languages and their subsequent conversion to Christianity. Only remnants are found in Greco-Roman sources and archaeology. Most surviving Celtic mythology be...",
          "full_content": "Celtic mythology is the body of myths belonging to the Celtic peoples. Like other Iron Age Europeans, Celtic peoples followed a polytheistic religion, having many gods and goddesses. The mythologies of continental Celtic peoples, such as the Gauls and Celtiberians, did not survive their conquest by the Roman Empire, the loss of their Celtic languages and their subsequent conversion to Christianity. Only remnants are found in Greco-Roman sources and archaeology. Most surviving Celtic mythology belongs to the Insular Celtic peoples (the Gaels of Ireland and Scotland; the Celtic Britons of western Britain and Brittany). They preserved some of their myths in oral lore, which were eventually written down by Christian scribes in the Middle Ages. Irish mythology has the largest written body of myths, followed by Welsh mythology. The supernatural race called the Tuatha De Danann is believed to be based on the main Celtic gods of Ireland, while many Welsh characters belong either to the Plant Don (\"Children of Don\") or the Plant Llr (\"Children of Llr\"). Some figures in Insular Celtic myth have ancient continental parallels: Irish Lugh and Welsh Lleu are cognate with Lugus, Goibniu and Gofannon with Gobannos, Macan and Mabon with Maponos, and so on. One common figure is the sovereignty goddess, who represents the land and bestows sovereignty on a king by marrying him. The Otherworld is also a common motif, a parallel realm of the supernatural races, which is visited by some mythical ...",
          "sections": [
            {
              "title": "Overview",
              "content": "Though the Celtic world at its height covered much of western and central Europe, it was not politically unified, nor was there any substantial central source of cultural influence or homogeneity; as ..."
            },
            {
              "title": "Historical sources",
              "content": "As a result of the scarcity of surviving materials bearing written Gaulish, it is surmised that most of the Celtic writings were destroyed by the Romans, though a written form of Gaulish using Greek, ..."
            },
            {
              "title": "Irish mythology",
              "content": "Irish mythology is the largest surviving branch of Celtic mythology. It was originally passed down orally in the prehistoric era. Many myths were later written down in the early medieval era by Christ..."
            },
            {
              "title": "Welsh mythology",
              "content": "Important reflexes of British mythology appear in the Four Branches of the Mabinogi, especially in the names of several characters, such as Rhiannon, Teyrnon, and Bran the Blessed (Bendigeidfran, \"Bra..."
            },
            {
              "title": "Remnants of Gaulish and other mythology",
              "content": "The Celts also worshiped a number of deities of which little more is known than their names. Classical writers preserve a few fragments of legends or myths that may possibly be Celtic. According to th..."
            },
            {
              "title": "See also",
              "content": "Banshee Cantabrian mythology Celtic Christianity Fisher King Galician mythology Niskai Triskelion Norse mythology"
            }
          ],
          "categories": [
            "Category:Articles containing Breton-language text",
            "Category:Articles containing Cornish-language text",
            "Category:Articles containing Irish-language text",
            "Category:Articles containing Manx-language text",
            "Category:Articles containing Scottish Gaelic-language text"
          ],
          "word_count": 2051,
          "summary_word_count": 247,
          "source_type": "wikipedia_api",
          "extraction_success": true
        },
        {
          "title": "Druid",
          "url": "https://en.wikipedia.org/wiki/Druid",
          "summary": "A druid was a member of the high-ranking priestly class in ancient Celtic cultures. The druids were religious leaders as well as legal authorities, adjudicators, lorekeepers, medical professionals and political advisors. Druids left no written accounts. While they were reported to have been literate, they are believed to have been prevented by doctrine from recording their knowledge in written form. Their beliefs and practices are attested in some detail by their contemporaries from other cultur...",
          "full_content": "A druid was a member of the high-ranking priestly class in ancient Celtic cultures. The druids were religious leaders as well as legal authorities, adjudicators, lorekeepers, medical professionals and political advisors. Druids left no written accounts. While they were reported to have been literate, they are believed to have been prevented by doctrine from recording their knowledge in written form. Their beliefs and practices are attested in some detail by their contemporaries from other cultures, such as the Romans and the Greeks. The earliest known references to the druids date to the 4th century BC. The oldest detailed description comes from Julius Caesar's Commentarii de Bello Gallico (50s BC). They were described by other Roman writers such as Cicero, Tacitus, and Pliny the Elder. Following the Roman invasion of Gaul, the druid orders were suppressed by the Roman government under the 1st-century AD emperors Tiberius and Claudius, and had disappeared from the written record by the 2nd century. In about 750 AD, the word druid appears in a poem by Blathmac, who wrote about Jesus, saying that he was \"better than a prophet, more knowledgeable than every druid, a king who was a bishop and a complete sage.\" The druids often appear in both the tales from Irish mythology first written down by monks and nuns of the Celtic Church like the \"Tain Bo Cuailnge\" (12th century), but also in later Christian legends where they are largely portrayed as sorcerers who opposed the introductio...",
          "sections": [
            {
              "title": "Etymology",
              "content": "The English word druid derives from the Latin word druids (plural), which was considered by ancient Roman writers to come from the native Gaulish word for these figures. Other Roman texts employ the ..."
            },
            {
              "title": "Practices and doctrines",
              "content": "Sources by ancient and medieval writers provide an idea of the religious duties and social roles involved in being a druid."
            },
            {
              "title": "Druids in mythology",
              "content": "Druids play a prominent role in Irish folklore, generally serving lords and kings as high ranking priest-counselors with the gift of prophecy and other assorted mystical abilities - the best example o..."
            },
            {
              "title": "Female druids",
              "content": ""
            },
            {
              "title": "Sources on druid beliefs and practices",
              "content": ""
            },
            {
              "title": "Archaeology",
              "content": "As the historian Jane Webster stated, \"individual druids ... are unlikely to be identified archaeologically\". A. P. Fitzpatrick, in examining what he believed to be astral symbolism on late Iron Age s..."
            }
          ],
          "categories": [
            "Category:All articles with failed verification",
            "Category:All articles with incomplete citations",
            "Category:Articles containing Ancient Greek (to 1453)-language text",
            "Category:Articles containing Breton-language text",
            "Category:Articles containing Cornish-language text"
          ],
          "word_count": 6360,
          "summary_word_count": 298,
          "source_type": "wikipedia_api",
          "extraction_success": true
        },
        {
          "title": "Ancient Celtic religion",
          "url": "https://en.wikipedia.org/wiki/Ancient_Celtic_religion",
          "summary": "Ancient Celtic religion, commonly known as Celtic paganism, was the religion of the ancient Celtic peoples of Europe. Because there are no extant native records of their beliefs, evidence about their religion is gleaned from archaeology, Greco-Roman accounts (some of them hostile and probably not well-informed), and literature from the early Christian period. Celtic paganism was one of a larger group of polytheistic Indo-European religions of Iron Age Europe. While the specific deities worshipp...",
          "full_content": "Ancient Celtic religion, commonly known as Celtic paganism, was the religion of the ancient Celtic peoples of Europe. Because there are no extant native records of their beliefs, evidence about their religion is gleaned from archaeology, Greco-Roman accounts (some of them hostile and probably not well-informed), and literature from the early Christian period. Celtic paganism was one of a larger group of polytheistic Indo-European religions of Iron Age Europe. While the specific deities worshipped varied by region and over time, underlying this were broad similarities in both deities and \"a basic religious homogeneity\" among the Celtic peoples. Widely worshipped Celtic gods included Lugus, Toutatis, Taranis, Cernunnos, Epona, Maponos, Belenos, and Sucellos. Sacred springs were often associated with Celtic healing deities. Triplicity is a common theme, with a number of deities seen as threefold, for example the Three Mothers. The druids were the priests of Celtic religion, but little is definitively known about them. Greco-Roman writers stated that the Celts held ceremonies in sacred groves and other natural shrines, called nemetons, while some Celtic peoples also built temples or ritual enclosures. Celtic peoples often made votive offerings which would be deposited in water and wetlands, or in ritual shafts and wells. There is evidence that ancient Celtic peoples sacrificed animals, almost always livestock or working animals. There is some evidence that ancient Celts sacrific...",
          "sections": [
            {
              "title": "History",
              "content": ""
            },
            {
              "title": "Sources",
              "content": "Comparatively little is known about Celtic paganism because the evidence for it is fragmentary, due largely to the fact that the Celts who practised it wrote nothing down about their religion. Therefo..."
            },
            {
              "title": "Deities",
              "content": "Celtic religion was polytheistic, believing in many deities, both gods and goddesses, some of which were venerated only in a small area or region, or by a particular tribe, but others whose worship ha..."
            },
            {
              "title": "Animistic aspects",
              "content": "Some scholars, such as Prudence Jones and Nigel Pennick, have speculated that the Celts venerated certain trees. Other scholars, such as Miranda Aldhouse-Green, believe that the Celts were animists, b..."
            },
            {
              "title": "Burial and afterlife",
              "content": "Celtic burial practices, which included burying grave goods of food, weapons, and ornaments with the dead, suggest a belief in life after death. A common factor in later mythologies from Christianized..."
            },
            {
              "title": "Celtic practice",
              "content": ""
            }
          ],
          "categories": [
            "Category:All accuracy disputes",
            "Category:All articles with incomplete citations",
            "Category:All articles with specifically marked weasel-worded phrases",
            "Category:All articles with unsourced statements",
            "Category:Ancient Celtic religion"
          ],
          "word_count": 5794,
          "summary_word_count": 246,
          "source_type": "wikipedia_api",
          "extraction_success": true
        }
      ],
      "success_count": 3,
      "total_attempted": 3,
      "success_rate": 1.0
    }
  },
  "extraction_timestamp": 1751490172.8079462
}