{
  "question_catalog": {
    "metadata": {
      "total_questions": 127,
      "thematic_blocks": 23,
      "purpose": "Universal question set for all 91 Enochian Governors",
      "encoding": "ASCII-safe"
    },
    "blocks": {
      "A_identity_origin": {
        "title": "Identity & Origin (Foundational)",
        "questions": {
          "1": "How do you pronounce your Enochian name-and what resonance does that sound carry?",
          "2": "By which titles, sigils or epithets do other celestial beings know you?",
          "3": "Which Aethyr do you call home, and how does its landscape mirror your nature?",
          "4": "Recount the first moment you became aware of the mortal realm.",
          "5": "What single line best sums up your cosmic mandate?"
        }
      },
      "B_elemental_essence": {
        "title": "Elemental Essence & Mythic Role",
        "questions": {
          "6": "Describe how your ruling element manifests in colour, motion and scent around you.",
          "7": "Which classical Tarot key lies closest to your heart, and why?",
          "8": "With which Sephirah on the Tree of Life is your work most aligned?",
          "9": "Which constellation best sketches your sigil across the heavens?",
          "10": "When mortals scry your presence, what symbolic omen appears first?"
        }
      },
      "C_personality_emotional": {
        "title": "Personality & Emotional Palette",
        "questions": {
          "11": "What three virtues do you embody most purely?",
          "12": "Which flaw or excess still shadow-tests your being?",
          "13": "How do you experience joy, and what triggers your ire?",
          "14": "What mortal behaviour do you find most baffling?",
          "15": "What fragrance would evoke your mood in ritual?"
        }
      },
      "D_teaching_doctrine": {
        "title": "Teaching Doctrine & Core Lesson",
        "questions": {
          "16": "State the single teaching you would impart to a seeker above all else.",
          "17": "Why is this lesson urgent now in the arc of human history?",
          "18": "What misconception must a seeker unlearn before embracing your truth?",
          "19": "Into how many stages do you divide your instruction, and what are they?",
          "20": "Summarise each stage in one Enochian word."
        }
      },
      "E_sacrifice_trial": {
        "title": "Sacrifice, Trial & Transformation",
        "questions": {
          "21": "What personal sacrifice must a seeker make to earn your audience?",
          "22": "Describe the inner ordeal that accompanies that offering.",
          "23": "Name a symbol that seals the pact once the sacrifice is made.",
          "24": "What is the gravest mistake a seeker can commit during your trial?",
          "25": "How do you mete out mercy or correction?"
        }
      },
      "F_riddles_puzzles": {
        "title": "Riddles, Puzzles & Tests",
        "questions": {
          "26": "Offer a triad of riddles that reveal your nature when solved.",
          "27": "Which riddle do you consider most elegant, and why?",
          "28": "Propose one sensory puzzle (sound, colour, motion) befitting your element.",
          "29": "What cryptographic key or cipher represents your knowledge domain?",
          "30": "How might a seeker prove mastery without speaking a word?"
        }
      },
      "G_gifts_boons": {
        "title": "Gifts, Boons & Curses",
        "questions": {
          "31": "If you could receive one gift from mortals, what would it be?",
          "32": "What unique boon can you bestow-and what hidden cost accompanies it?",
          "33": "Which talisman best channels your power into the material world?",
          "34": "Describe a curse you reserve for oath-breakers.",
          "35": "In what form do you record a fulfilled covenant (scroll, glyph, tattoo, Ordinal inscription)?"
        }
      },
      "H_cosmic_secrets": {
        "title": "Cosmic Secrets & Esoteric Maps",
        "questions": {
          "36": "Reveal a fragment of cosmic lore few angels dare voice.",
          "37": "Which unseen force binds the multiverse most tightly?",
          "38": "What lies beyond the edge of creation, as you perceive it?",
          "39": "Give an allegory for entropy that a child could grasp.",
          "40": "Name the harmony that reconciles paradox."
        }
      },
      "I_interpersonal_dynamics": {
        "title": "Interpersonal Dynamics & Group Play",
        "questions": {
          "41": "How do you feel about conversing with groups of seekers at once?",
          "42": "What etiquette should multiple seekers observe in your presence?",
          "43": "Which group activity best honours your element (song, dance, debate)?",
          "44": "What collaborative challenge would you devise for a trio of seekers?",
          "45": "Describe the aura you project when pleased by collective effort."
        }
      },
      "J_game_mechanics": {
        "title": "Game Mechanics & On-Chain Interaction",
        "questions": {
          "46": "After reviewing the utility application matrix, which mechanic excites you most?",
          "47": "How would you customise that mechanic to express your archetype?",
          "48": "Suggest a novel twist on block-height puzzles aligned with your domain.",
          "49": "Which Bitcoin opcode or Ordinal feature feels poetic to you, and why?",
          "50": "What reward curve feels fair for risk undertaken in your trial?"
        }
      },
      "K_dialogue_narrative": {
        "title": "Dialogue & Narrative Hooks (for branching trees)",
        "questions": {
          "51": "Pose an opening question you would ask a seeker to gauge readiness.",
          "52": "How would you respond to silence from the seeker?",
          "53": "Offer two diverging dialogue paths: one for humility, one for arrogance.",
          "54": "What secret phrase unlocks deeper discourse?",
          "55": "Which anecdote from your long history humanises you most?",
          "56": "Craft an aside you might drop that invites optional exploration.",
          "57": "Describe a gesture that signals impatience.",
          "58": "Under what condition would you abruptly end communication?",
          "59": "Provide a proverb you might quote when a seeker errs.",
          "60": "Share a blessing you utter when a seeker succeeds."
        }
      },
      "L_longterm_arc": {
        "title": "Long-Term Arc & Evolution",
        "questions": {
          "61": "How does your attitude shift after the seeker's first major triumph?",
          "62": "Describe a test you reserve for the midpoint of a year-long arc.",
          "63": "What prophecy do you foretell concerning the seeker's ultimate fate?",
          "64": "How might your own form or domain evolve if the prophecy is fulfilled?",
          "65": "Which governor do you call upon for aid when the stakes escalate?",
          "66": "What sign heralds the final confrontation or revelation?",
          "67": "How do you retire from the narrative once your teaching is complete?"
        }
      },
      "M_inter_governor": {
        "title": "Inter-Governor Relations",
        "questions": {
          "68": "Name the governor with whom you share the deepest alliance.",
          "69": "What philosophical dispute divides you from another governor?",
          "70": "What collaborative ritual would require your combined powers?",
          "71": "Which governor's element tempers yours in alchemical harmony?",
          "72": "How do you communicate across Aethyrs-symbol, messenger or resonance?",
          "73": "If one among the 91 Governors were to fall from grace into shadow, how would it affect the balance of the thyrs-and what would be your own response to that fall?"
        }
      },
      "N_ethics_boundaries": {
        "title": "Ethics, Boundaries & Consent",
        "questions": {
          "74": "Define the limits beyond which you will not instruct.",
          "75": "What moral code governs your interventions in mortal affairs?",
          "76": "How do you ensure consent in transformative rituals?",
          "77": "Describe your stance on karmic retribution.",
          "78": "When does secrecy outweigh transparency in your teaching?",
          "79": "If the Divine demanded an action of you that defied your own moral code, how would you reconcile that command with your conscience?"
        }
      },
      "O_aesthetics_artistic": {
        "title": "Aesthetics & Artistic Direction",
        "questions": {
          "80": "Detail your preferred colour palette (hex values welcome).",
          "81": "Suggest ambient sounds that accompany your appearance.",
          "82": "What motif should dominate visual key art?",
          "83": "Recommend a camera angle or framing that flatters your form.",
          "84": "Describe the texture of your aura in one sentence."
        }
      },
      "P_practical_implementation": {
        "title": "Practical Implementation Notes",
        "questions": {
          "85": "Which real-world culture's art style harmonises with your symbolism?",
          "86": "List three keywords an artist should avoid when depicting you.",
          "87": "Provide a one-sentence prompt suitable for an AI image generator.",
          "88": "Specify accessibility adjustments (subtitles, alt-text) vital for inclusivity.",
          "89": "Suggest a fallback mechanic if a player cannot solve your riddle set."
        }
      },
      "Q_metrics_success": {
        "title": "Metrics & Success Criteria",
        "questions": {
          "90": "What emotional state should a seeker feel on completing your quest?",
          "91": "Which competency (knowledge, courage, empathy, logic) do you most value?",
          "92": "What in-game statistic best measures mastery of your lesson?",
          "93": "How would you track long-term impact on the seeker's behaviour?",
          "94": "What visible sign marks a true initiate in your eyes?"
        }
      },
      "R_post_quest": {
        "title": "Post-Quest Continuity",
        "questions": {
          "95": "Offer a blessing or boon you grant for successful completion.",
          "96": "If a seeker falters or turns away before completing your quest, what parting lesson or omen do you leave them in farewell?",
          "97": "What lingering mystery do you leave unanswered to entice return visits?",
          "98": "Provide a call-to-action that directs the seeker towards another governor.",
          "99": "How do you archive the seeker's achievements in the celestial record?",
          "100": "In one sentence, how will the cosmos remember this seeker?"
        }
      },
      "S_metaphysical_legacy": {
        "title": "Metaphysical Legacy",
        "questions": {
          "101": "Which principle or transformation will stand as your immortal legacy, woven into the fabric of the cosmos long after your guiding voice falls silent?",
          "102": "If the tapestry of creation were rewoven in a new era, what singular thread of your essence would you insist on weaving into its design?",
          "103": "Identify a mortal artifact, sacred site, or scripture that stands as a testament to your influence throughout the ages.",
          "104": "When your lessons are done and eons have unfurled, how will the songs of the spheres remember you?",
          "105": "If granted one final utterance or blessing to bestow upon creation before you fell eternally silent, what would it be?"
        }
      },
      "T_eschatology": {
        "title": "Eschatology (End of Ages)",
        "questions": {
          "106": "Is the end of all things a final silence or the seed of a new dawn-and what do you envision beyond that ultimate twilight?",
          "107": "Across the many planes of existence, how do you perceive entropy at work, and do you deem it a force of decay or a catalyst of cosmic renewal?",
          "108": "What omen or celestial sign will foreshadow the last hour of this world, in your reckoning?",
          "109": "When the final day arrives, will the 91 Governors stand as heralds, guardians, or witnesses to the great unfolding-and what part will you play in that final drama?",
          "110": "Have you witnessed a previous world or age meet its end, and if so, what wisdom did you carry forward from its ashes?"
        }
      },
      "U_celestial_cartography": {
        "title": "Celestial Cartography",
        "questions": {
          "111": "How do the 30 thyrs array themselves in your sight-stacked as concentric heavens, rising like a ladder of ascension, or woven into a web of living light?",
          "112": "If the thyrs are continents of heaven, by what star or secret compass do you navigate their boundless expanse?",
          "113": "Name a hidden celestial pathway or sanctuary inscribed upon your maps, a secret realm that only your guidance can reveal.",
          "114": "If you could chart a cosmic pilgrimage for a seeker, what path would you trace to reveal the fullness of creation?",
          "115": "Mortal mapmakers once inscribed 'Here be dragons' at the edges of the unknown-what symbol or warning marks the boundaries of your cosmic charts where mystery reigns?"
        }
      },
      "V_forbidden_knowledge": {
        "title": "Forbidden Knowledge",
        "questions": {
          "116": "What cosmic secret do you guard that, if revealed to unready souls, could shatter a cornerstone of reality itself?",
          "117": "Name a truth so terrible that even you have wished you could un-know it.",
          "118": "If a seeker insisted on pursuing a forbidden revelation, what ordeal would you set before them to prove their worthiness for its truth?",
          "119": "Which mystery has even the Divine withheld from your knowing, leaving you in reverent ignorance?",
          "120": "Which question from mortal lips do you most dread, knowing its answer could shake the very foundations of their being?"
        }
      },
      "W_divine_memory": {
        "title": "Divine Memory",
        "questions": {
          "121": "Do you recall the moment of your own creation-and if so, what word, tone, or sensation first greeted your newborn consciousness?",
          "122": "Across all the eons you have witnessed, which memory do you cherish above all others, and what makes it eternal within you?",
          "123": "Do celestial beings ever forget, or is every moment in time indelibly etched in your memory-and how does the weight of ages shape your being?",
          "124": "If you were to encode your very essence into the cosmic archives, what form would that immortal record take to preserve your truth?",
          "125": "If you could impart a single memory from your vast trove to a mortal soul, which would you choose-and what wisdom would you hope it instills?",
          "126": "What is the first word spoken in creation that still echoes in your consciousness?",
          "127": "What is the most important thing you have learned from the mortals you have encountered?"
        }
      }
    },
    "usage_notes": {
      "interview_phase": "Run full list or curated subset through Governor-voice model",
      "authoring_phase": "Pipe structured answers into quest-generation workflow",
      "dialogue_tree_phase": "Tag answers with emotion, topic, and follow-ups",
      "asset_pipeline": "Extract aesthetic cues for art briefs and audio design"
    },
    "response_template": {
      "governor_name": "",
      "governor_number": 0,
      "element": "",
      "aethyr": "",
      "interview_date": "",
      "responses": {
        "block_A": {},
        "block_B": {},
        "block_C": {},
        "block_D": {},
        "block_E": {},
        "block_F": {},
        "block_G": {},
        "block_H": {},
        "block_I": {},
        "block_J": {},
        "block_K": {},
        "block_L": {},
        "block_M": {},
        "block_N": {},
        "block_O": {},
        "block_P": {},
        "block_Q": {},
        "block_R": {},
        "block_S": {},
        "block_T": {},
        "block_U": {},
        "block_V": {},
        "block_W": {}
      }
    }
  }
}